SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/common/hc32f460kcta.h
    /* WDT */
    INT_WDT_REFUDF          = 439u,

    /* ADC */
    INT_ADC1_EOCA           = 448u,
    INT_ADC1_EOCB           = 449u,
    INT_ADC1_CHCMP          = 450u,
    INT_ADC1_SEQCMP         = 451u,
    INT_ADC2_EOCA           = 452u,
    INT_ADC2_EOCB           = 453u,
    INT_ADC2_CHCMP          = 454u,
    INT_ADC2_SEQCMP         = 455u,

    /* TRNG */
    INT_TRNG_END            = 456u,

    /* SDIOC */
    INT_SDIOC1_SD           = 482u,
    INT_SDIOC2_SD           = 485u,

    /* CAN */
    INT_CAN_INT             = 486u,

    INT_MAX                 = 511u,
}en_int_src_t;

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

typedef struct
{
    __IO uint8_t STRT                       : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    __IO uint16_t AVCNT                     : 3;
    uint16_t RESERVED11                     : 5;
} stc_adc_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t RSCHSEL                   : 1;
    uint16_t RESERVED3                      :13;
} stc_adc_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 3;
    uint16_t RESERVED3                      : 4;
    __IO uint16_t TRGENA                    : 1;
    __IO uint16_t TRGSELB                   : 3;
    uint16_t RESERVED11                     : 4;
    __IO uint16_t TRGENB                    : 1;
} stc_adc_trgsr_field_t;

typedef struct
{
    __IO uint16_t CHSELA16                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_chselra1_field_t;

typedef struct
{
    __IO uint16_t CHSELB16                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_chselrb1_field_t;

typedef struct
{
    __IO uint16_t AVCHSEL16                 : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_avchselr1_field_t;

typedef struct
{
    __IO uint16_t CH00MUX                   : 4;
    __IO uint16_t CH01MUX                   : 4;
    __IO uint16_t CH02MUX                   : 4;
    __IO uint16_t CH03MUX                   : 4;
} stc_adc_chmuxr0_field_t;

typedef struct
{
    __IO uint16_t CH04MUX                   : 4;
    __IO uint16_t CH05MUX                   : 4;
    __IO uint16_t CH06MUX                   : 4;
    __IO uint16_t CH07MUX                   : 4;
} stc_adc_chmuxr1_field_t;

typedef struct
{
    __IO uint16_t CH08MUX                   : 4;
    __IO uint16_t CH09MUX                   : 4;
    __IO uint16_t CH10MUX                   : 4;
    __IO uint16_t CH11MUX                   : 4;
} stc_adc_chmuxr2_field_t;

typedef struct
{
    __IO uint16_t CH12MUX                   : 4;
    __IO uint16_t CH13MUX                   : 4;
    __IO uint16_t CH14MUX                   : 4;
    __IO uint16_t CH15MUX                   : 4;
} stc_adc_chmuxr3_field_t;

typedef struct
{
    __IO uint8_t EOCAF                      : 1;
    __IO uint8_t EOCBF                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isr_field_t;

typedef struct
{
    __IO uint8_t EOCAIEN                    : 1;
    __IO uint8_t EOCBIEN                    : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_icr_field_t;

typedef struct
{
    __IO uint16_t SYNCEN                    : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t SYNCMD                    : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t SYNCDLY                   : 8;
} stc_adc_synccr_field_t;

typedef struct
{
    __IO uint16_t AWDEN                     : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t AWDMD                     : 1;
    uint16_t RESERVED5                      : 1;
    __IO uint16_t AWDSS                     : 2;
    __IO uint16_t AWDIEN                    : 1;
    uint16_t RESERVED9                      : 7;
} stc_adc_awdcr_field_t;

typedef struct
{
    __IO uint16_t AWDCH16                   : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_awdchsr1_field_t;

typedef struct
{
    __IO uint16_t AWDF16                    : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_awdsr1_field_t;

typedef struct
{
    __IO uint16_t PGACTL                    : 4;
    uint16_t RESERVED4                      :12;
} stc_adc_pgacr_field_t;

typedef struct
{
    __IO uint16_t GAIN                      : 4;
    uint16_t RESERVED4                      :12;
} stc_adc_pgagsr_field_t;

typedef struct
{
    __IO uint16_t PGAINSEL                  : 9;
    uint16_t RESERVED9                      : 7;
} stc_adc_pgainsr0_field_t;

typedef struct
{
    __IO uint16_t PGAVSSEN                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_pgainsr1_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
    __IO uint32_t MODE                      : 1;
    uint32_t RESERVED2                      :30;
} stc_aes_cr_field_t;

typedef struct
{
    __IO uint32_t STRG                      : 1;
    uint32_t RESERVED1                      :31;
} stc_aos_int_sfttrg_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dcu1_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dcu2_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dcu3_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dcu4_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma1_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma1_trgsel3_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma2_trgsel_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma_trgselrc_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_tmr6_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_tmr0_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_port_pevnttrgsr12_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_port_pevnttrgsr34_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_tmra_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_ots_trg_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_adc1_itrgselr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_adc2_itrgselr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :23;
} stc_aos_comtrg1_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :23;
} stc_aos_comtrg2_field_t;

typedef struct
{
    __IO uint32_t PDIR00                    : 1;
    __IO uint32_t PDIR01                    : 1;
    __IO uint32_t PDIR02                    : 1;
    __IO uint32_t PDIR03                    : 1;
    __IO uint32_t PDIR04                    : 1;
    __IO uint32_t PDIR05                    : 1;
    __IO uint32_t PDIR06                    : 1;
    __IO uint32_t PDIR07                    : 1;
    __IO uint32_t PDIR08                    : 1;
    __IO uint32_t PDIR09                    : 1;
    __IO uint32_t PDIR10                    : 1;
    __IO uint32_t PDIR11                    : 1;
    __IO uint32_t PDIR12                    : 1;
    __IO uint32_t PDIR13                    : 1;
    __IO uint32_t PDIR14                    : 1;
    __IO uint32_t PDIR15                    : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntdirr_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntidr_field_t;

typedef struct
{
    __IO uint32_t POUT00                    : 1;
    __IO uint32_t POUT01                    : 1;
    __IO uint32_t POUT02                    : 1;
    __IO uint32_t POUT03                    : 1;
    __IO uint32_t POUT04                    : 1;
    __IO uint32_t POUT05                    : 1;
    __IO uint32_t POUT06                    : 1;
    __IO uint32_t POUT07                    : 1;
    __IO uint32_t POUT08                    : 1;
    __IO uint32_t POUT09                    : 1;
    __IO uint32_t POUT10                    : 1;
    __IO uint32_t POUT11                    : 1;
    __IO uint32_t POUT12                    : 1;
    __IO uint32_t POUT13                    : 1;
    __IO uint32_t POUT14                    : 1;
    __IO uint32_t POUT15                    : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntodr_field_t;

typedef struct
{
    __IO uint32_t POR00                     : 1;
    __IO uint32_t POR01                     : 1;
    __IO uint32_t POR02                     : 1;
    __IO uint32_t POR03                     : 1;
    __IO uint32_t POR04                     : 1;
    __IO uint32_t POR05                     : 1;
    __IO uint32_t POR06                     : 1;
    __IO uint32_t POR07                     : 1;
    __IO uint32_t POR08                     : 1;
    __IO uint32_t POR09                     : 1;
    __IO uint32_t POR10                     : 1;
    __IO uint32_t POR11                     : 1;
    __IO uint32_t POR12                     : 1;
    __IO uint32_t POR13                     : 1;
    __IO uint32_t POR14                     : 1;
    __IO uint32_t POR15                     : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntorr_field_t;

typedef struct
{
    __IO uint32_t POS00                     : 1;
    __IO uint32_t POS01                     : 1;
    __IO uint32_t POS02                     : 1;
    __IO uint32_t POS03                     : 1;
    __IO uint32_t POS04                     : 1;
    __IO uint32_t POS05                     : 1;
    __IO uint32_t POS06                     : 1;
    __IO uint32_t POS07                     : 1;
    __IO uint32_t POS08                     : 1;
    __IO uint32_t POS09                     : 1;
    __IO uint32_t POS10                     : 1;
    __IO uint32_t POS11                     : 1;
    __IO uint32_t POS12                     : 1;
    __IO uint32_t POS13                     : 1;
    __IO uint32_t POS14                     : 1;
    __IO uint32_t POS15                     : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntosr_field_t;

typedef struct
{
    __IO uint32_t RIS00                     : 1;
    __IO uint32_t RIS01                     : 1;
    __IO uint32_t RIS02                     : 1;
    __IO uint32_t RIS03                     : 1;
    __IO uint32_t RIS04                     : 1;
    __IO uint32_t RIS05                     : 1;
    __IO uint32_t RIS06                     : 1;
    __IO uint32_t RIS07                     : 1;
    __IO uint32_t RIS08                     : 1;
    __IO uint32_t RIS09                     : 1;
    __IO uint32_t RIS10                     : 1;
    __IO uint32_t RIS11                     : 1;
    __IO uint32_t RIS12                     : 1;
    __IO uint32_t RIS13                     : 1;
    __IO uint32_t RIS14                     : 1;
    __IO uint32_t RIS15                     : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntrisr_field_t;

typedef struct
{
    __IO uint32_t FAL00                     : 1;
    __IO uint32_t FAL01                     : 1;
    __IO uint32_t FAL02                     : 1;
    __IO uint32_t FAL03                     : 1;
    __IO uint32_t FAL04                     : 1;
    __IO uint32_t FAL05                     : 1;
    __IO uint32_t FAL06                     : 1;
    __IO uint32_t FAL07                     : 1;
    __IO uint32_t FAL08                     : 1;
    __IO uint32_t FAL09                     : 1;
    __IO uint32_t FAL10                     : 1;
    __IO uint32_t FAL11                     : 1;
    __IO uint32_t FAL12                     : 1;
    __IO uint32_t FAL13                     : 1;
    __IO uint32_t FAL14                     : 1;
    __IO uint32_t FAL15                     : 1;
    uint32_t RESERVED16                     :16;
} stc_aos_pevntfal_field_t;

typedef struct
{
    __IO uint32_t NFEN1                     : 1;
    __IO uint32_t DIVS1                     : 2;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t NFEN2                     : 1;
    __IO uint32_t DIVS2                     : 2;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t NFEN3                     : 1;
    __IO uint32_t DIVS3                     : 2;
    uint32_t RESERVED19                     : 5;
    __IO uint32_t NFEN4                     : 1;
    __IO uint32_t DIVS4                     : 2;
    uint32_t RESERVED27                     : 5;
} stc_aos_pevntnfcr_field_t;

typedef struct
{
    __IO uint8_t BUSOFF                     : 1;
    __IO uint8_t TACTIVE                    : 1;
    __IO uint8_t RACTIVE                    : 1;
    __IO uint8_t TSSS                       : 1;
    __IO uint8_t TPSS                       : 1;
    __IO uint8_t LBMI                       : 1;
    __IO uint8_t LBME                       : 1;
    __IO uint8_t RESET                      : 1;
} stc_can_cfg_stat_field_t;

typedef struct
{
    __IO uint8_t TSA                        : 1;
    __IO uint8_t TSALL                      : 1;
    __IO uint8_t TSONE                      : 1;
    __IO uint8_t TPA                        : 1;
    __IO uint8_t TPE                        : 1;
    __IO uint8_t STBY                       : 1;
    __IO uint8_t LOM                        : 1;
    __IO uint8_t TBSEL                      : 1;
} stc_can_tcmd_field_t;

typedef struct
{
    __IO uint8_t TSSTAT                     : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t TTBM                       : 1;
    __IO uint8_t TSMODE                     : 1;
    __IO uint8_t TSNEXT                     : 1;
    uint8_t RESERVED7                       : 1;
} stc_can_tctrl_field_t;

typedef struct
{
    __IO uint8_t RSSTAT                     : 2;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t RBALL                      : 1;
    __IO uint8_t RREL                       : 1;
    __IO uint8_t ROV                        : 1;
    __IO uint8_t ROM                        : 1;
    __IO uint8_t SACK                       : 1;
} stc_can_rctrl_field_t;

typedef struct
{
    __IO uint8_t TSFF                       : 1;
    __IO uint8_t EIE                        : 1;
    __IO uint8_t TSIE                       : 1;
    __IO uint8_t TPIE                       : 1;
    __IO uint8_t RAFIE                      : 1;
    __IO uint8_t RFIE                       : 1;
    __IO uint8_t ROIE                       : 1;
    __IO uint8_t RIE                        : 1;
} stc_can_rtie_field_t;

typedef struct
{
    __IO uint8_t AIF                        : 1;
    __IO uint8_t EIF                        : 1;
    __IO uint8_t TSIF                       : 1;
    __IO uint8_t TPIF                       : 1;
    __IO uint8_t RAFIF                      : 1;
    __IO uint8_t RFIF                       : 1;
    __IO uint8_t ROIF                       : 1;
    __IO uint8_t RIF                        : 1;
} stc_can_rtif_field_t;

typedef struct
{
    __IO uint8_t BEIF                       : 1;
    __IO uint8_t BEIE                       : 1;
    __IO uint8_t ALIF                       : 1;
    __IO uint8_t ALIE                       : 1;
    __IO uint8_t EPIF                       : 1;
    __IO uint8_t EPIE                       : 1;
    __IO uint8_t EPASS                      : 1;
    __IO uint8_t EWARN                      : 1;
} stc_can_errint_field_t;

typedef struct
{
    __IO uint8_t EWL                        : 4;
    __IO uint8_t AFWL                       : 4;
} stc_can_limit_field_t;

typedef struct
{
    __IO uint32_t SEG_1                     : 8;
    __IO uint32_t SEG_2                     : 7;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t SJW                       : 7;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t PRESC                     : 8;
} stc_can_bt_field_t;

typedef struct
{
    __IO uint8_t ALC                        : 5;
    __IO uint8_t KOER                       : 3;
} stc_can_ealcap_field_t;

typedef struct
{
    __IO uint8_t ACFADR                     : 4;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t SELMASK                    : 1;
    uint8_t RESERVED6                       : 2;
} stc_can_acfctrl_field_t;

typedef struct
{
    __IO uint8_t AE_1                       : 1;
    __IO uint8_t AE_2                       : 1;
    __IO uint8_t AE_3                       : 1;
    __IO uint8_t AE_4                       : 1;
    __IO uint8_t AE_5                       : 1;
    __IO uint8_t AE_6                       : 1;
    __IO uint8_t AE_7                       : 1;
    __IO uint8_t AE_8                       : 1;
} stc_can_acfen_field_t;

typedef struct
{
    __IO uint32_t ACODEORAMASK              :29;
    __IO uint32_t AIDE                      : 1;
    __IO uint32_t AIDEE                     : 1;
    uint32_t RESERVED31                     : 1;
} stc_can_acf_field_t;

typedef struct
{
    __IO uint8_t TBPTR                      : 6;
    __IO uint8_t TBF                        : 1;
    __IO uint8_t TBE                        : 1;
} stc_can_tbslot_field_t;

typedef struct
{
    __IO uint8_t TTEN                       : 1;
    __IO uint8_t T_PRESC                    : 2;
    __IO uint8_t TTIF                       : 1;
    __IO uint8_t TTIE                       : 1;
    __IO uint8_t TEIF                       : 1;
    __IO uint8_t WTIF                       : 1;
    __IO uint8_t WTIE                       : 1;
} stc_can_ttcfg_field_t;

typedef struct
{
    __IO uint32_t REF_ID                    :29;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t REF_IDE                   : 1;
} stc_can_ref_msg_field_t;

typedef struct
{
    __IO uint16_t TTPTR                     : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t TTYPE                     : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t TEW                       : 4;
} stc_can_trg_cfg_field_t;

typedef struct
{
    __IO uint16_t FLTSL                     : 3;
    uint16_t RESERVED3                      : 2;
    __IO uint16_t EDGSL                     : 2;
    __IO uint16_t IEN                       : 1;
    __IO uint16_t CVSEN                     : 1;
    uint16_t RESERVED9                      : 3;
    __IO uint16_t OUTEN                     : 1;
    __IO uint16_t INV                       : 1;
    __IO uint16_t CMPOE                     : 1;
    __IO uint16_t CMPON                     : 1;
} stc_cmp_ctrl_field_t;

typedef struct
{
    __IO uint16_t RVSL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CVSL                      : 4;
    __IO uint16_t C4SL                      : 3;
    uint16_t RESERVED15                     : 1;
} stc_cmp_vltsel_field_t;

typedef struct
{
    __IO uint16_t OMON                      : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t CVST                      : 4;
    uint16_t RESERVED12                     : 4;
} stc_cmp_mon_field_t;

typedef struct
{
    __IO uint16_t STB                       : 4;
    uint16_t RESERVED4                      :12;
} stc_cmp_cvsstb_field_t;

typedef struct
{
    __IO uint16_t PRD                       : 8;
    uint16_t RESERVED8                      : 8;
} stc_cmp_cvsprd_field_t;

typedef struct
{
    __IO uint16_t DATA                      : 8;
    uint16_t RESERVED8                      : 8;
} stc_cmp_cr_dadr1_field_t;

typedef struct
{
    __IO uint16_t DATA                      : 8;
    uint16_t RESERVED8                      : 8;
} stc_cmp_cr_dadr2_field_t;

typedef struct
{
    __IO uint16_t DA1EN                     : 1;
    __IO uint16_t DA2EN                     : 1;
    uint16_t RESERVED2                      :14;
} stc_cmp_cr_dacr_field_t;

typedef struct
{
    __IO uint16_t DA1SW                     : 1;
    __IO uint16_t DA2SW                     : 1;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t VREFSW                    : 1;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t WPRT                      : 8;
} stc_cmp_cr_rvadc_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t CRC_SEL                   : 1;
    __IO uint32_t REFIN                     : 1;
    __IO uint32_t REFOUT                    : 1;
    __IO uint32_t XOROUT                    : 1;
    uint32_t RESERVED5                      :27;
} stc_crc_cr_field_t;

typedef struct
{
    __IO uint32_t FLAG                      : 1;
    uint32_t RESERVED1                      :31;
} stc_crc_flg_field_t;

