SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/common/hc32f460kcta.h
#define bM4_INTC_SEL34_INTSEL3                    (*((volatile unsigned int*)(0x42A21C8CUL)))
#define bM4_INTC_SEL34_INTSEL4                    (*((volatile unsigned int*)(0x42A21C90UL)))
#define bM4_INTC_SEL34_INTSEL5                    (*((volatile unsigned int*)(0x42A21C94UL)))
#define bM4_INTC_SEL34_INTSEL6                    (*((volatile unsigned int*)(0x42A21C98UL)))
#define bM4_INTC_SEL34_INTSEL7                    (*((volatile unsigned int*)(0x42A21C9CUL)))
#define bM4_INTC_SEL34_INTSEL8                    (*((volatile unsigned int*)(0x42A21CA0UL)))
#define bM4_INTC_SEL35_INTSEL0                    (*((volatile unsigned int*)(0x42A21D00UL)))
#define bM4_INTC_SEL35_INTSEL1                    (*((volatile unsigned int*)(0x42A21D04UL)))
#define bM4_INTC_SEL35_INTSEL2                    (*((volatile unsigned int*)(0x42A21D08UL)))
#define bM4_INTC_SEL35_INTSEL3                    (*((volatile unsigned int*)(0x42A21D0CUL)))
#define bM4_INTC_SEL35_INTSEL4                    (*((volatile unsigned int*)(0x42A21D10UL)))
#define bM4_INTC_SEL35_INTSEL5                    (*((volatile unsigned int*)(0x42A21D14UL)))
#define bM4_INTC_SEL35_INTSEL6                    (*((volatile unsigned int*)(0x42A21D18UL)))
#define bM4_INTC_SEL35_INTSEL7                    (*((volatile unsigned int*)(0x42A21D1CUL)))
#define bM4_INTC_SEL35_INTSEL8                    (*((volatile unsigned int*)(0x42A21D20UL)))
#define bM4_INTC_SEL36_INTSEL0                    (*((volatile unsigned int*)(0x42A21D80UL)))
#define bM4_INTC_SEL36_INTSEL1                    (*((volatile unsigned int*)(0x42A21D84UL)))
#define bM4_INTC_SEL36_INTSEL2                    (*((volatile unsigned int*)(0x42A21D88UL)))
#define bM4_INTC_SEL36_INTSEL3                    (*((volatile unsigned int*)(0x42A21D8CUL)))
#define bM4_INTC_SEL36_INTSEL4                    (*((volatile unsigned int*)(0x42A21D90UL)))
#define bM4_INTC_SEL36_INTSEL5                    (*((volatile unsigned int*)(0x42A21D94UL)))
#define bM4_INTC_SEL36_INTSEL6                    (*((volatile unsigned int*)(0x42A21D98UL)))
#define bM4_INTC_SEL36_INTSEL7                    (*((volatile unsigned int*)(0x42A21D9CUL)))
#define bM4_INTC_SEL36_INTSEL8                    (*((volatile unsigned int*)(0x42A21DA0UL)))
#define bM4_INTC_SEL37_INTSEL0                    (*((volatile unsigned int*)(0x42A21E00UL)))
#define bM4_INTC_SEL37_INTSEL1                    (*((volatile unsigned int*)(0x42A21E04UL)))
#define bM4_INTC_SEL37_INTSEL2                    (*((volatile unsigned int*)(0x42A21E08UL)))
#define bM4_INTC_SEL37_INTSEL3                    (*((volatile unsigned int*)(0x42A21E0CUL)))
#define bM4_INTC_SEL37_INTSEL4                    (*((volatile unsigned int*)(0x42A21E10UL)))
#define bM4_INTC_SEL37_INTSEL5                    (*((volatile unsigned int*)(0x42A21E14UL)))
#define bM4_INTC_SEL37_INTSEL6                    (*((volatile unsigned int*)(0x42A21E18UL)))
#define bM4_INTC_SEL37_INTSEL7                    (*((volatile unsigned int*)(0x42A21E1CUL)))
#define bM4_INTC_SEL37_INTSEL8                    (*((volatile unsigned int*)(0x42A21E20UL)))
#define bM4_INTC_SEL38_INTSEL0                    (*((volatile unsigned int*)(0x42A21E80UL)))
#define bM4_INTC_SEL38_INTSEL1                    (*((volatile unsigned int*)(0x42A21E84UL)))
#define bM4_INTC_SEL38_INTSEL2                    (*((volatile unsigned int*)(0x42A21E88UL)))
#define bM4_INTC_SEL38_INTSEL3                    (*((volatile unsigned int*)(0x42A21E8CUL)))
#define bM4_INTC_SEL38_INTSEL4                    (*((volatile unsigned int*)(0x42A21E90UL)))
#define bM4_INTC_SEL38_INTSEL5                    (*((volatile unsigned int*)(0x42A21E94UL)))
#define bM4_INTC_SEL38_INTSEL6                    (*((volatile unsigned int*)(0x42A21E98UL)))
#define bM4_INTC_SEL38_INTSEL7                    (*((volatile unsigned int*)(0x42A21E9CUL)))
#define bM4_INTC_SEL38_INTSEL8                    (*((volatile unsigned int*)(0x42A21EA0UL)))
#define bM4_INTC_SEL39_INTSEL0                    (*((volatile unsigned int*)(0x42A21F00UL)))
#define bM4_INTC_SEL39_INTSEL1                    (*((volatile unsigned int*)(0x42A21F04UL)))
#define bM4_INTC_SEL39_INTSEL2                    (*((volatile unsigned int*)(0x42A21F08UL)))
#define bM4_INTC_SEL39_INTSEL3                    (*((volatile unsigned int*)(0x42A21F0CUL)))
#define bM4_INTC_SEL39_INTSEL4                    (*((volatile unsigned int*)(0x42A21F10UL)))
#define bM4_INTC_SEL39_INTSEL5                    (*((volatile unsigned int*)(0x42A21F14UL)))
#define bM4_INTC_SEL39_INTSEL6                    (*((volatile unsigned int*)(0x42A21F18UL)))
#define bM4_INTC_SEL39_INTSEL7                    (*((volatile unsigned int*)(0x42A21F1CUL)))
#define bM4_INTC_SEL39_INTSEL8                    (*((volatile unsigned int*)(0x42A21F20UL)))
#define bM4_INTC_SEL40_INTSEL0                    (*((volatile unsigned int*)(0x42A21F80UL)))
#define bM4_INTC_SEL40_INTSEL1                    (*((volatile unsigned int*)(0x42A21F84UL)))
#define bM4_INTC_SEL40_INTSEL2                    (*((volatile unsigned int*)(0x42A21F88UL)))
#define bM4_INTC_SEL40_INTSEL3                    (*((volatile unsigned int*)(0x42A21F8CUL)))
#define bM4_INTC_SEL40_INTSEL4                    (*((volatile unsigned int*)(0x42A21F90UL)))
#define bM4_INTC_SEL40_INTSEL5                    (*((volatile unsigned int*)(0x42A21F94UL)))
#define bM4_INTC_SEL40_INTSEL6                    (*((volatile unsigned int*)(0x42A21F98UL)))
#define bM4_INTC_SEL40_INTSEL7                    (*((volatile unsigned int*)(0x42A21F9CUL)))
#define bM4_INTC_SEL40_INTSEL8                    (*((volatile unsigned int*)(0x42A21FA0UL)))
#define bM4_INTC_SEL41_INTSEL0                    (*((volatile unsigned int*)(0x42A22000UL)))
#define bM4_INTC_SEL41_INTSEL1                    (*((volatile unsigned int*)(0x42A22004UL)))
#define bM4_INTC_SEL41_INTSEL2                    (*((volatile unsigned int*)(0x42A22008UL)))
#define bM4_INTC_SEL41_INTSEL3                    (*((volatile unsigned int*)(0x42A2200CUL)))
#define bM4_INTC_SEL41_INTSEL4                    (*((volatile unsigned int*)(0x42A22010UL)))
#define bM4_INTC_SEL41_INTSEL5                    (*((volatile unsigned int*)(0x42A22014UL)))
#define bM4_INTC_SEL41_INTSEL6                    (*((volatile unsigned int*)(0x42A22018UL)))
#define bM4_INTC_SEL41_INTSEL7                    (*((volatile unsigned int*)(0x42A2201CUL)))
#define bM4_INTC_SEL41_INTSEL8                    (*((volatile unsigned int*)(0x42A22020UL)))
#define bM4_INTC_SEL42_INTSEL0                    (*((volatile unsigned int*)(0x42A22080UL)))
#define bM4_INTC_SEL42_INTSEL1                    (*((volatile unsigned int*)(0x42A22084UL)))
#define bM4_INTC_SEL42_INTSEL2                    (*((volatile unsigned int*)(0x42A22088UL)))
#define bM4_INTC_SEL42_INTSEL3                    (*((volatile unsigned int*)(0x42A2208CUL)))
#define bM4_INTC_SEL42_INTSEL4                    (*((volatile unsigned int*)(0x42A22090UL)))
#define bM4_INTC_SEL42_INTSEL5                    (*((volatile unsigned int*)(0x42A22094UL)))
#define bM4_INTC_SEL42_INTSEL6                    (*((volatile unsigned int*)(0x42A22098UL)))
#define bM4_INTC_SEL42_INTSEL7                    (*((volatile unsigned int*)(0x42A2209CUL)))
#define bM4_INTC_SEL42_INTSEL8                    (*((volatile unsigned int*)(0x42A220A0UL)))
#define bM4_INTC_SEL43_INTSEL0                    (*((volatile unsigned int*)(0x42A22100UL)))
#define bM4_INTC_SEL43_INTSEL1                    (*((volatile unsigned int*)(0x42A22104UL)))
#define bM4_INTC_SEL43_INTSEL2                    (*((volatile unsigned int*)(0x42A22108UL)))
#define bM4_INTC_SEL43_INTSEL3                    (*((volatile unsigned int*)(0x42A2210CUL)))
#define bM4_INTC_SEL43_INTSEL4                    (*((volatile unsigned int*)(0x42A22110UL)))
#define bM4_INTC_SEL43_INTSEL5                    (*((volatile unsigned int*)(0x42A22114UL)))
#define bM4_INTC_SEL43_INTSEL6                    (*((volatile unsigned int*)(0x42A22118UL)))
#define bM4_INTC_SEL43_INTSEL7                    (*((volatile unsigned int*)(0x42A2211CUL)))
#define bM4_INTC_SEL43_INTSEL8                    (*((volatile unsigned int*)(0x42A22120UL)))
#define bM4_INTC_SEL44_INTSEL0                    (*((volatile unsigned int*)(0x42A22180UL)))
#define bM4_INTC_SEL44_INTSEL1                    (*((volatile unsigned int*)(0x42A22184UL)))
#define bM4_INTC_SEL44_INTSEL2                    (*((volatile unsigned int*)(0x42A22188UL)))
#define bM4_INTC_SEL44_INTSEL3                    (*((volatile unsigned int*)(0x42A2218CUL)))
#define bM4_INTC_SEL44_INTSEL4                    (*((volatile unsigned int*)(0x42A22190UL)))
#define bM4_INTC_SEL44_INTSEL5                    (*((volatile unsigned int*)(0x42A22194UL)))
#define bM4_INTC_SEL44_INTSEL6                    (*((volatile unsigned int*)(0x42A22198UL)))
#define bM4_INTC_SEL44_INTSEL7                    (*((volatile unsigned int*)(0x42A2219CUL)))
#define bM4_INTC_SEL44_INTSEL8                    (*((volatile unsigned int*)(0x42A221A0UL)))
#define bM4_INTC_SEL45_INTSEL0                    (*((volatile unsigned int*)(0x42A22200UL)))
#define bM4_INTC_SEL45_INTSEL1                    (*((volatile unsigned int*)(0x42A22204UL)))
#define bM4_INTC_SEL45_INTSEL2                    (*((volatile unsigned int*)(0x42A22208UL)))
#define bM4_INTC_SEL45_INTSEL3                    (*((volatile unsigned int*)(0x42A2220CUL)))
#define bM4_INTC_SEL45_INTSEL4                    (*((volatile unsigned int*)(0x42A22210UL)))
#define bM4_INTC_SEL45_INTSEL5                    (*((volatile unsigned int*)(0x42A22214UL)))
#define bM4_INTC_SEL45_INTSEL6                    (*((volatile unsigned int*)(0x42A22218UL)))
#define bM4_INTC_SEL45_INTSEL7                    (*((volatile unsigned int*)(0x42A2221CUL)))
#define bM4_INTC_SEL45_INTSEL8                    (*((volatile unsigned int*)(0x42A22220UL)))
#define bM4_INTC_SEL46_INTSEL0                    (*((volatile unsigned int*)(0x42A22280UL)))
#define bM4_INTC_SEL46_INTSEL1                    (*((volatile unsigned int*)(0x42A22284UL)))
#define bM4_INTC_SEL46_INTSEL2                    (*((volatile unsigned int*)(0x42A22288UL)))
#define bM4_INTC_SEL46_INTSEL3                    (*((volatile unsigned int*)(0x42A2228CUL)))
#define bM4_INTC_SEL46_INTSEL4                    (*((volatile unsigned int*)(0x42A22290UL)))
#define bM4_INTC_SEL46_INTSEL5                    (*((volatile unsigned int*)(0x42A22294UL)))
#define bM4_INTC_SEL46_INTSEL6                    (*((volatile unsigned int*)(0x42A22298UL)))
#define bM4_INTC_SEL46_INTSEL7                    (*((volatile unsigned int*)(0x42A2229CUL)))
#define bM4_INTC_SEL46_INTSEL8                    (*((volatile unsigned int*)(0x42A222A0UL)))
#define bM4_INTC_SEL47_INTSEL0                    (*((volatile unsigned int*)(0x42A22300UL)))
#define bM4_INTC_SEL47_INTSEL1                    (*((volatile unsigned int*)(0x42A22304UL)))
#define bM4_INTC_SEL47_INTSEL2                    (*((volatile unsigned int*)(0x42A22308UL)))
#define bM4_INTC_SEL47_INTSEL3                    (*((volatile unsigned int*)(0x42A2230CUL)))
#define bM4_INTC_SEL47_INTSEL4                    (*((volatile unsigned int*)(0x42A22310UL)))
#define bM4_INTC_SEL47_INTSEL5                    (*((volatile unsigned int*)(0x42A22314UL)))
#define bM4_INTC_SEL47_INTSEL6                    (*((volatile unsigned int*)(0x42A22318UL)))
#define bM4_INTC_SEL47_INTSEL7                    (*((volatile unsigned int*)(0x42A2231CUL)))
#define bM4_INTC_SEL47_INTSEL8                    (*((volatile unsigned int*)(0x42A22320UL)))
#define bM4_INTC_SEL48_INTSEL0                    (*((volatile unsigned int*)(0x42A22380UL)))
#define bM4_INTC_SEL48_INTSEL1                    (*((volatile unsigned int*)(0x42A22384UL)))
#define bM4_INTC_SEL48_INTSEL2                    (*((volatile unsigned int*)(0x42A22388UL)))
#define bM4_INTC_SEL48_INTSEL3                    (*((volatile unsigned int*)(0x42A2238CUL)))
#define bM4_INTC_SEL48_INTSEL4                    (*((volatile unsigned int*)(0x42A22390UL)))
#define bM4_INTC_SEL48_INTSEL5                    (*((volatile unsigned int*)(0x42A22394UL)))
#define bM4_INTC_SEL48_INTSEL6                    (*((volatile unsigned int*)(0x42A22398UL)))
#define bM4_INTC_SEL48_INTSEL7                    (*((volatile unsigned int*)(0x42A2239CUL)))
#define bM4_INTC_SEL48_INTSEL8                    (*((volatile unsigned int*)(0x42A223A0UL)))
#define bM4_INTC_SEL49_INTSEL0                    (*((volatile unsigned int*)(0x42A22400UL)))
#define bM4_INTC_SEL49_INTSEL1                    (*((volatile unsigned int*)(0x42A22404UL)))
#define bM4_INTC_SEL49_INTSEL2                    (*((volatile unsigned int*)(0x42A22408UL)))
#define bM4_INTC_SEL49_INTSEL3                    (*((volatile unsigned int*)(0x42A2240CUL)))
#define bM4_INTC_SEL49_INTSEL4                    (*((volatile unsigned int*)(0x42A22410UL)))
#define bM4_INTC_SEL49_INTSEL5                    (*((volatile unsigned int*)(0x42A22414UL)))
#define bM4_INTC_SEL49_INTSEL6                    (*((volatile unsigned int*)(0x42A22418UL)))
#define bM4_INTC_SEL49_INTSEL7                    (*((volatile unsigned int*)(0x42A2241CUL)))
#define bM4_INTC_SEL49_INTSEL8                    (*((volatile unsigned int*)(0x42A22420UL)))
#define bM4_INTC_SEL50_INTSEL0                    (*((volatile unsigned int*)(0x42A22480UL)))
#define bM4_INTC_SEL50_INTSEL1                    (*((volatile unsigned int*)(0x42A22484UL)))
#define bM4_INTC_SEL50_INTSEL2                    (*((volatile unsigned int*)(0x42A22488UL)))
#define bM4_INTC_SEL50_INTSEL3                    (*((volatile unsigned int*)(0x42A2248CUL)))
#define bM4_INTC_SEL50_INTSEL4                    (*((volatile unsigned int*)(0x42A22490UL)))
#define bM4_INTC_SEL50_INTSEL5                    (*((volatile unsigned int*)(0x42A22494UL)))
#define bM4_INTC_SEL50_INTSEL6                    (*((volatile unsigned int*)(0x42A22498UL)))
#define bM4_INTC_SEL50_INTSEL7                    (*((volatile unsigned int*)(0x42A2249CUL)))
#define bM4_INTC_SEL50_INTSEL8                    (*((volatile unsigned int*)(0x42A224A0UL)))
#define bM4_INTC_SEL51_INTSEL0                    (*((volatile unsigned int*)(0x42A22500UL)))
#define bM4_INTC_SEL51_INTSEL1                    (*((volatile unsigned int*)(0x42A22504UL)))
#define bM4_INTC_SEL51_INTSEL2                    (*((volatile unsigned int*)(0x42A22508UL)))
#define bM4_INTC_SEL51_INTSEL3                    (*((volatile unsigned int*)(0x42A2250CUL)))
#define bM4_INTC_SEL51_INTSEL4                    (*((volatile unsigned int*)(0x42A22510UL)))
#define bM4_INTC_SEL51_INTSEL5                    (*((volatile unsigned int*)(0x42A22514UL)))
#define bM4_INTC_SEL51_INTSEL6                    (*((volatile unsigned int*)(0x42A22518UL)))
#define bM4_INTC_SEL51_INTSEL7                    (*((volatile unsigned int*)(0x42A2251CUL)))
#define bM4_INTC_SEL51_INTSEL8                    (*((volatile unsigned int*)(0x42A22520UL)))
#define bM4_INTC_SEL52_INTSEL0                    (*((volatile unsigned int*)(0x42A22580UL)))
#define bM4_INTC_SEL52_INTSEL1                    (*((volatile unsigned int*)(0x42A22584UL)))
#define bM4_INTC_SEL52_INTSEL2                    (*((volatile unsigned int*)(0x42A22588UL)))
#define bM4_INTC_SEL52_INTSEL3                    (*((volatile unsigned int*)(0x42A2258CUL)))
#define bM4_INTC_SEL52_INTSEL4                    (*((volatile unsigned int*)(0x42A22590UL)))
#define bM4_INTC_SEL52_INTSEL5                    (*((volatile unsigned int*)(0x42A22594UL)))
#define bM4_INTC_SEL52_INTSEL6                    (*((volatile unsigned int*)(0x42A22598UL)))
#define bM4_INTC_SEL52_INTSEL7                    (*((volatile unsigned int*)(0x42A2259CUL)))
#define bM4_INTC_SEL52_INTSEL8                    (*((volatile unsigned int*)(0x42A225A0UL)))
#define bM4_INTC_SEL53_INTSEL0                    (*((volatile unsigned int*)(0x42A22600UL)))
#define bM4_INTC_SEL53_INTSEL1                    (*((volatile unsigned int*)(0x42A22604UL)))
#define bM4_INTC_SEL53_INTSEL2                    (*((volatile unsigned int*)(0x42A22608UL)))
#define bM4_INTC_SEL53_INTSEL3                    (*((volatile unsigned int*)(0x42A2260CUL)))
#define bM4_INTC_SEL53_INTSEL4                    (*((volatile unsigned int*)(0x42A22610UL)))
#define bM4_INTC_SEL53_INTSEL5                    (*((volatile unsigned int*)(0x42A22614UL)))
#define bM4_INTC_SEL53_INTSEL6                    (*((volatile unsigned int*)(0x42A22618UL)))
#define bM4_INTC_SEL53_INTSEL7                    (*((volatile unsigned int*)(0x42A2261CUL)))
#define bM4_INTC_SEL53_INTSEL8                    (*((volatile unsigned int*)(0x42A22620UL)))
#define bM4_INTC_SEL54_INTSEL0                    (*((volatile unsigned int*)(0x42A22680UL)))
#define bM4_INTC_SEL54_INTSEL1                    (*((volatile unsigned int*)(0x42A22684UL)))
#define bM4_INTC_SEL54_INTSEL2                    (*((volatile unsigned int*)(0x42A22688UL)))
#define bM4_INTC_SEL54_INTSEL3                    (*((volatile unsigned int*)(0x42A2268CUL)))
#define bM4_INTC_SEL54_INTSEL4                    (*((volatile unsigned int*)(0x42A22690UL)))
#define bM4_INTC_SEL54_INTSEL5                    (*((volatile unsigned int*)(0x42A22694UL)))
#define bM4_INTC_SEL54_INTSEL6                    (*((volatile unsigned int*)(0x42A22698UL)))
#define bM4_INTC_SEL54_INTSEL7                    (*((volatile unsigned int*)(0x42A2269CUL)))
#define bM4_INTC_SEL54_INTSEL8                    (*((volatile unsigned int*)(0x42A226A0UL)))
#define bM4_INTC_SEL55_INTSEL0                    (*((volatile unsigned int*)(0x42A22700UL)))
#define bM4_INTC_SEL55_INTSEL1                    (*((volatile unsigned int*)(0x42A22704UL)))
#define bM4_INTC_SEL55_INTSEL2                    (*((volatile unsigned int*)(0x42A22708UL)))
#define bM4_INTC_SEL55_INTSEL3                    (*((volatile unsigned int*)(0x42A2270CUL)))
#define bM4_INTC_SEL55_INTSEL4                    (*((volatile unsigned int*)(0x42A22710UL)))
#define bM4_INTC_SEL55_INTSEL5                    (*((volatile unsigned int*)(0x42A22714UL)))
#define bM4_INTC_SEL55_INTSEL6                    (*((volatile unsigned int*)(0x42A22718UL)))
#define bM4_INTC_SEL55_INTSEL7                    (*((volatile unsigned int*)(0x42A2271CUL)))
#define bM4_INTC_SEL55_INTSEL8                    (*((volatile unsigned int*)(0x42A22720UL)))
#define bM4_INTC_SEL56_INTSEL0                    (*((volatile unsigned int*)(0x42A22780UL)))
#define bM4_INTC_SEL56_INTSEL1                    (*((volatile unsigned int*)(0x42A22784UL)))
#define bM4_INTC_SEL56_INTSEL2                    (*((volatile unsigned int*)(0x42A22788UL)))
#define bM4_INTC_SEL56_INTSEL3                    (*((volatile unsigned int*)(0x42A2278CUL)))
#define bM4_INTC_SEL56_INTSEL4                    (*((volatile unsigned int*)(0x42A22790UL)))
#define bM4_INTC_SEL56_INTSEL5                    (*((volatile unsigned int*)(0x42A22794UL)))
#define bM4_INTC_SEL56_INTSEL6                    (*((volatile unsigned int*)(0x42A22798UL)))
#define bM4_INTC_SEL56_INTSEL7                    (*((volatile unsigned int*)(0x42A2279CUL)))
#define bM4_INTC_SEL56_INTSEL8                    (*((volatile unsigned int*)(0x42A227A0UL)))
#define bM4_INTC_SEL57_INTSEL0                    (*((volatile unsigned int*)(0x42A22800UL)))
#define bM4_INTC_SEL57_INTSEL1                    (*((volatile unsigned int*)(0x42A22804UL)))
#define bM4_INTC_SEL57_INTSEL2                    (*((volatile unsigned int*)(0x42A22808UL)))
#define bM4_INTC_SEL57_INTSEL3                    (*((volatile unsigned int*)(0x42A2280CUL)))
#define bM4_INTC_SEL57_INTSEL4                    (*((volatile unsigned int*)(0x42A22810UL)))
#define bM4_INTC_SEL57_INTSEL5                    (*((volatile unsigned int*)(0x42A22814UL)))
#define bM4_INTC_SEL57_INTSEL6                    (*((volatile unsigned int*)(0x42A22818UL)))
#define bM4_INTC_SEL57_INTSEL7                    (*((volatile unsigned int*)(0x42A2281CUL)))
#define bM4_INTC_SEL57_INTSEL8                    (*((volatile unsigned int*)(0x42A22820UL)))
#define bM4_INTC_SEL58_INTSEL0                    (*((volatile unsigned int*)(0x42A22880UL)))
#define bM4_INTC_SEL58_INTSEL1                    (*((volatile unsigned int*)(0x42A22884UL)))
#define bM4_INTC_SEL58_INTSEL2                    (*((volatile unsigned int*)(0x42A22888UL)))
#define bM4_INTC_SEL58_INTSEL3                    (*((volatile unsigned int*)(0x42A2288CUL)))
#define bM4_INTC_SEL58_INTSEL4                    (*((volatile unsigned int*)(0x42A22890UL)))
#define bM4_INTC_SEL58_INTSEL5                    (*((volatile unsigned int*)(0x42A22894UL)))
#define bM4_INTC_SEL58_INTSEL6                    (*((volatile unsigned int*)(0x42A22898UL)))
#define bM4_INTC_SEL58_INTSEL7                    (*((volatile unsigned int*)(0x42A2289CUL)))
#define bM4_INTC_SEL58_INTSEL8                    (*((volatile unsigned int*)(0x42A228A0UL)))
#define bM4_INTC_SEL59_INTSEL0                    (*((volatile unsigned int*)(0x42A22900UL)))
#define bM4_INTC_SEL59_INTSEL1                    (*((volatile unsigned int*)(0x42A22904UL)))
#define bM4_INTC_SEL59_INTSEL2                    (*((volatile unsigned int*)(0x42A22908UL)))
#define bM4_INTC_SEL59_INTSEL3                    (*((volatile unsigned int*)(0x42A2290CUL)))
#define bM4_INTC_SEL59_INTSEL4                    (*((volatile unsigned int*)(0x42A22910UL)))
#define bM4_INTC_SEL59_INTSEL5                    (*((volatile unsigned int*)(0x42A22914UL)))
#define bM4_INTC_SEL59_INTSEL6                    (*((volatile unsigned int*)(0x42A22918UL)))
#define bM4_INTC_SEL59_INTSEL7                    (*((volatile unsigned int*)(0x42A2291CUL)))
#define bM4_INTC_SEL59_INTSEL8                    (*((volatile unsigned int*)(0x42A22920UL)))
#define bM4_INTC_SEL60_INTSEL0                    (*((volatile unsigned int*)(0x42A22980UL)))
#define bM4_INTC_SEL60_INTSEL1                    (*((volatile unsigned int*)(0x42A22984UL)))
#define bM4_INTC_SEL60_INTSEL2                    (*((volatile unsigned int*)(0x42A22988UL)))
#define bM4_INTC_SEL60_INTSEL3                    (*((volatile unsigned int*)(0x42A2298CUL)))
#define bM4_INTC_SEL60_INTSEL4                    (*((volatile unsigned int*)(0x42A22990UL)))
#define bM4_INTC_SEL60_INTSEL5                    (*((volatile unsigned int*)(0x42A22994UL)))
#define bM4_INTC_SEL60_INTSEL6                    (*((volatile unsigned int*)(0x42A22998UL)))
#define bM4_INTC_SEL60_INTSEL7                    (*((volatile unsigned int*)(0x42A2299CUL)))
#define bM4_INTC_SEL60_INTSEL8                    (*((volatile unsigned int*)(0x42A229A0UL)))
#define bM4_INTC_SEL61_INTSEL0                    (*((volatile unsigned int*)(0x42A22A00UL)))
#define bM4_INTC_SEL61_INTSEL1                    (*((volatile unsigned int*)(0x42A22A04UL)))
#define bM4_INTC_SEL61_INTSEL2                    (*((volatile unsigned int*)(0x42A22A08UL)))
#define bM4_INTC_SEL61_INTSEL3                    (*((volatile unsigned int*)(0x42A22A0CUL)))
#define bM4_INTC_SEL61_INTSEL4                    (*((volatile unsigned int*)(0x42A22A10UL)))
#define bM4_INTC_SEL61_INTSEL5                    (*((volatile unsigned int*)(0x42A22A14UL)))
#define bM4_INTC_SEL61_INTSEL6                    (*((volatile unsigned int*)(0x42A22A18UL)))
#define bM4_INTC_SEL61_INTSEL7                    (*((volatile unsigned int*)(0x42A22A1CUL)))
#define bM4_INTC_SEL61_INTSEL8                    (*((volatile unsigned int*)(0x42A22A20UL)))
#define bM4_INTC_SEL62_INTSEL0                    (*((volatile unsigned int*)(0x42A22A80UL)))
#define bM4_INTC_SEL62_INTSEL1                    (*((volatile unsigned int*)(0x42A22A84UL)))
#define bM4_INTC_SEL62_INTSEL2                    (*((volatile unsigned int*)(0x42A22A88UL)))
#define bM4_INTC_SEL62_INTSEL3                    (*((volatile unsigned int*)(0x42A22A8CUL)))
#define bM4_INTC_SEL62_INTSEL4                    (*((volatile unsigned int*)(0x42A22A90UL)))
#define bM4_INTC_SEL62_INTSEL5                    (*((volatile unsigned int*)(0x42A22A94UL)))
