SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/common/hc32f460kcta.h
#define bM4_TMR41_OCMRHVH_OPNPKH0                 (*((volatile unsigned int*)(0x422E05B0UL)))
#define bM4_TMR41_OCMRHVH_OPNPKH1                 (*((volatile unsigned int*)(0x422E05B4UL)))
#define bM4_TMR41_OCMRHVH_OPNZRH0                 (*((volatile unsigned int*)(0x422E05B8UL)))
#define bM4_TMR41_OCMRHVH_OPNZRH1                 (*((volatile unsigned int*)(0x422E05BCUL)))
#define bM4_TMR41_OCMRLVL_OCFDCL                  (*((volatile unsigned int*)(0x422E0600UL)))
#define bM4_TMR41_OCMRLVL_OCFPKL                  (*((volatile unsigned int*)(0x422E0604UL)))
#define bM4_TMR41_OCMRLVL_OCFUCL                  (*((volatile unsigned int*)(0x422E0608UL)))
#define bM4_TMR41_OCMRLVL_OCFZRL                  (*((volatile unsigned int*)(0x422E060CUL)))
#define bM4_TMR41_OCMRLVL_OPDCL0                  (*((volatile unsigned int*)(0x422E0610UL)))
#define bM4_TMR41_OCMRLVL_OPDCL1                  (*((volatile unsigned int*)(0x422E0614UL)))
#define bM4_TMR41_OCMRLVL_OPPKL0                  (*((volatile unsigned int*)(0x422E0618UL)))
#define bM4_TMR41_OCMRLVL_OPPKL1                  (*((volatile unsigned int*)(0x422E061CUL)))
#define bM4_TMR41_OCMRLVL_OPUCL0                  (*((volatile unsigned int*)(0x422E0620UL)))
#define bM4_TMR41_OCMRLVL_OPUCL1                  (*((volatile unsigned int*)(0x422E0624UL)))
#define bM4_TMR41_OCMRLVL_OPZRL0                  (*((volatile unsigned int*)(0x422E0628UL)))
#define bM4_TMR41_OCMRLVL_OPZRL1                  (*((volatile unsigned int*)(0x422E062CUL)))
#define bM4_TMR41_OCMRLVL_OPNPKL0                 (*((volatile unsigned int*)(0x422E0630UL)))
#define bM4_TMR41_OCMRLVL_OPNPKL1                 (*((volatile unsigned int*)(0x422E0634UL)))
#define bM4_TMR41_OCMRLVL_OPNZRL0                 (*((volatile unsigned int*)(0x422E0638UL)))
#define bM4_TMR41_OCMRLVL_OPNZRL1                 (*((volatile unsigned int*)(0x422E063CUL)))
#define bM4_TMR41_OCMRLVL_EOPNDCL0                (*((volatile unsigned int*)(0x422E0640UL)))
#define bM4_TMR41_OCMRLVL_EOPNDCL1                (*((volatile unsigned int*)(0x422E0644UL)))
#define bM4_TMR41_OCMRLVL_EOPNUCL0                (*((volatile unsigned int*)(0x422E0648UL)))
#define bM4_TMR41_OCMRLVL_EOPNUCL1                (*((volatile unsigned int*)(0x422E064CUL)))
#define bM4_TMR41_OCMRLVL_EOPDCL0                 (*((volatile unsigned int*)(0x422E0650UL)))
#define bM4_TMR41_OCMRLVL_EOPDCL1                 (*((volatile unsigned int*)(0x422E0654UL)))
#define bM4_TMR41_OCMRLVL_EOPPKL0                 (*((volatile unsigned int*)(0x422E0658UL)))
#define bM4_TMR41_OCMRLVL_EOPPKL1                 (*((volatile unsigned int*)(0x422E065CUL)))
#define bM4_TMR41_OCMRLVL_EOPUCL0                 (*((volatile unsigned int*)(0x422E0660UL)))
#define bM4_TMR41_OCMRLVL_EOPUCL1                 (*((volatile unsigned int*)(0x422E0664UL)))
#define bM4_TMR41_OCMRLVL_EOPZRL0                 (*((volatile unsigned int*)(0x422E0668UL)))
#define bM4_TMR41_OCMRLVL_EOPZRL1                 (*((volatile unsigned int*)(0x422E066CUL)))
#define bM4_TMR41_OCMRLVL_EOPNPKL0                (*((volatile unsigned int*)(0x422E0670UL)))
#define bM4_TMR41_OCMRLVL_EOPNPKL1                (*((volatile unsigned int*)(0x422E0674UL)))
#define bM4_TMR41_OCMRLVL_EOPNZRL0                (*((volatile unsigned int*)(0x422E0678UL)))
#define bM4_TMR41_OCMRLVL_EOPNZRL1                (*((volatile unsigned int*)(0x422E067CUL)))
#define bM4_TMR41_OCMRHWH_OCFDCH                  (*((volatile unsigned int*)(0x422E0680UL)))
#define bM4_TMR41_OCMRHWH_OCFPKH                  (*((volatile unsigned int*)(0x422E0684UL)))
#define bM4_TMR41_OCMRHWH_OCFUCH                  (*((volatile unsigned int*)(0x422E0688UL)))
#define bM4_TMR41_OCMRHWH_OCFZRH                  (*((volatile unsigned int*)(0x422E068CUL)))
#define bM4_TMR41_OCMRHWH_OPDCH0                  (*((volatile unsigned int*)(0x422E0690UL)))
#define bM4_TMR41_OCMRHWH_OPDCH1                  (*((volatile unsigned int*)(0x422E0694UL)))
#define bM4_TMR41_OCMRHWH_OPPKH0                  (*((volatile unsigned int*)(0x422E0698UL)))
#define bM4_TMR41_OCMRHWH_OPPKH1                  (*((volatile unsigned int*)(0x422E069CUL)))
#define bM4_TMR41_OCMRHWH_OPUCH0                  (*((volatile unsigned int*)(0x422E06A0UL)))
#define bM4_TMR41_OCMRHWH_OPUCH1                  (*((volatile unsigned int*)(0x422E06A4UL)))
#define bM4_TMR41_OCMRHWH_OPZRH0                  (*((volatile unsigned int*)(0x422E06A8UL)))
#define bM4_TMR41_OCMRHWH_OPZRH1                  (*((volatile unsigned int*)(0x422E06ACUL)))
#define bM4_TMR41_OCMRHWH_OPNPKH0                 (*((volatile unsigned int*)(0x422E06B0UL)))
#define bM4_TMR41_OCMRHWH_OPNPKH1                 (*((volatile unsigned int*)(0x422E06B4UL)))
#define bM4_TMR41_OCMRHWH_OPNZRH0                 (*((volatile unsigned int*)(0x422E06B8UL)))
#define bM4_TMR41_OCMRHWH_OPNZRH1                 (*((volatile unsigned int*)(0x422E06BCUL)))
#define bM4_TMR41_OCMRLWL_OCFDCL                  (*((volatile unsigned int*)(0x422E0700UL)))
#define bM4_TMR41_OCMRLWL_OCFPKL                  (*((volatile unsigned int*)(0x422E0704UL)))
#define bM4_TMR41_OCMRLWL_OCFUCL                  (*((volatile unsigned int*)(0x422E0708UL)))
#define bM4_TMR41_OCMRLWL_OCFZRL                  (*((volatile unsigned int*)(0x422E070CUL)))
#define bM4_TMR41_OCMRLWL_OPDCL0                  (*((volatile unsigned int*)(0x422E0710UL)))
#define bM4_TMR41_OCMRLWL_OPDCL1                  (*((volatile unsigned int*)(0x422E0714UL)))
#define bM4_TMR41_OCMRLWL_OPPKL0                  (*((volatile unsigned int*)(0x422E0718UL)))
#define bM4_TMR41_OCMRLWL_OPPKL1                  (*((volatile unsigned int*)(0x422E071CUL)))
#define bM4_TMR41_OCMRLWL_OPUCL0                  (*((volatile unsigned int*)(0x422E0720UL)))
#define bM4_TMR41_OCMRLWL_OPUCL1                  (*((volatile unsigned int*)(0x422E0724UL)))
#define bM4_TMR41_OCMRLWL_OPZRL0                  (*((volatile unsigned int*)(0x422E0728UL)))
#define bM4_TMR41_OCMRLWL_OPZRL1                  (*((volatile unsigned int*)(0x422E072CUL)))
#define bM4_TMR41_OCMRLWL_OPNPKL0                 (*((volatile unsigned int*)(0x422E0730UL)))
#define bM4_TMR41_OCMRLWL_OPNPKL1                 (*((volatile unsigned int*)(0x422E0734UL)))
#define bM4_TMR41_OCMRLWL_OPNZRL0                 (*((volatile unsigned int*)(0x422E0738UL)))
#define bM4_TMR41_OCMRLWL_OPNZRL1                 (*((volatile unsigned int*)(0x422E073CUL)))
#define bM4_TMR41_OCMRLWL_EOPNDCL0                (*((volatile unsigned int*)(0x422E0740UL)))
#define bM4_TMR41_OCMRLWL_EOPNDCL1                (*((volatile unsigned int*)(0x422E0744UL)))
#define bM4_TMR41_OCMRLWL_EOPNUCL0                (*((volatile unsigned int*)(0x422E0748UL)))
#define bM4_TMR41_OCMRLWL_EOPNUCL1                (*((volatile unsigned int*)(0x422E074CUL)))
#define bM4_TMR41_OCMRLWL_EOPDCL0                 (*((volatile unsigned int*)(0x422E0750UL)))
#define bM4_TMR41_OCMRLWL_EOPDCL1                 (*((volatile unsigned int*)(0x422E0754UL)))
#define bM4_TMR41_OCMRLWL_EOPPKL0                 (*((volatile unsigned int*)(0x422E0758UL)))
#define bM4_TMR41_OCMRLWL_EOPPKL1                 (*((volatile unsigned int*)(0x422E075CUL)))
#define bM4_TMR41_OCMRLWL_EOPUCL0                 (*((volatile unsigned int*)(0x422E0760UL)))
#define bM4_TMR41_OCMRLWL_EOPUCL1                 (*((volatile unsigned int*)(0x422E0764UL)))
#define bM4_TMR41_OCMRLWL_EOPZRL0                 (*((volatile unsigned int*)(0x422E0768UL)))
#define bM4_TMR41_OCMRLWL_EOPZRL1                 (*((volatile unsigned int*)(0x422E076CUL)))
#define bM4_TMR41_OCMRLWL_EOPNPKL0                (*((volatile unsigned int*)(0x422E0770UL)))
#define bM4_TMR41_OCMRLWL_EOPNPKL1                (*((volatile unsigned int*)(0x422E0774UL)))
#define bM4_TMR41_OCMRLWL_EOPNZRL0                (*((volatile unsigned int*)(0x422E0778UL)))
#define bM4_TMR41_OCMRLWL_EOPNZRL1                (*((volatile unsigned int*)(0x422E077CUL)))
#define bM4_TMR41_CCSR_CKDIV0                     (*((volatile unsigned int*)(0x422E0900UL)))
#define bM4_TMR41_CCSR_CKDIV1                     (*((volatile unsigned int*)(0x422E0904UL)))
#define bM4_TMR41_CCSR_CKDIV2                     (*((volatile unsigned int*)(0x422E0908UL)))
#define bM4_TMR41_CCSR_CKDIV3                     (*((volatile unsigned int*)(0x422E090CUL)))
#define bM4_TMR41_CCSR_CLEAR                      (*((volatile unsigned int*)(0x422E0910UL)))
#define bM4_TMR41_CCSR_MODE                       (*((volatile unsigned int*)(0x422E0914UL)))
#define bM4_TMR41_CCSR_STOP                       (*((volatile unsigned int*)(0x422E0918UL)))
#define bM4_TMR41_CCSR_BUFEN                      (*((volatile unsigned int*)(0x422E091CUL)))
#define bM4_TMR41_CCSR_IRQPEN                     (*((volatile unsigned int*)(0x422E0920UL)))
#define bM4_TMR41_CCSR_IRQPF                      (*((volatile unsigned int*)(0x422E0924UL)))
#define bM4_TMR41_CCSR_IRQZEN                     (*((volatile unsigned int*)(0x422E0934UL)))
#define bM4_TMR41_CCSR_IRQZF                      (*((volatile unsigned int*)(0x422E0938UL)))
#define bM4_TMR41_CCSR_ECKEN                      (*((volatile unsigned int*)(0x422E093CUL)))
#define bM4_TMR41_CVPR_ZIM0                       (*((volatile unsigned int*)(0x422E0940UL)))
#define bM4_TMR41_CVPR_ZIM1                       (*((volatile unsigned int*)(0x422E0944UL)))
#define bM4_TMR41_CVPR_ZIM2                       (*((volatile unsigned int*)(0x422E0948UL)))
#define bM4_TMR41_CVPR_ZIM3                       (*((volatile unsigned int*)(0x422E094CUL)))
#define bM4_TMR41_CVPR_PIM0                       (*((volatile unsigned int*)(0x422E0950UL)))
#define bM4_TMR41_CVPR_PIM1                       (*((volatile unsigned int*)(0x422E0954UL)))
#define bM4_TMR41_CVPR_PIM2                       (*((volatile unsigned int*)(0x422E0958UL)))
#define bM4_TMR41_CVPR_PIM3                       (*((volatile unsigned int*)(0x422E095CUL)))
#define bM4_TMR41_CVPR_ZIC0                       (*((volatile unsigned int*)(0x422E0960UL)))
#define bM4_TMR41_CVPR_ZIC1                       (*((volatile unsigned int*)(0x422E0964UL)))
#define bM4_TMR41_CVPR_ZIC2                       (*((volatile unsigned int*)(0x422E0968UL)))
#define bM4_TMR41_CVPR_ZIC3                       (*((volatile unsigned int*)(0x422E096CUL)))
#define bM4_TMR41_CVPR_PIC0                       (*((volatile unsigned int*)(0x422E0970UL)))
#define bM4_TMR41_CVPR_PIC1                       (*((volatile unsigned int*)(0x422E0974UL)))
#define bM4_TMR41_CVPR_PIC2                       (*((volatile unsigned int*)(0x422E0978UL)))
#define bM4_TMR41_CVPR_PIC3                       (*((volatile unsigned int*)(0x422E097CUL)))
#define bM4_TMR41_POCRU_DIVCK0                    (*((volatile unsigned int*)(0x422E1300UL)))
#define bM4_TMR41_POCRU_DIVCK1                    (*((volatile unsigned int*)(0x422E1304UL)))
#define bM4_TMR41_POCRU_DIVCK2                    (*((volatile unsigned int*)(0x422E1308UL)))
#define bM4_TMR41_POCRU_DIVCK3                    (*((volatile unsigned int*)(0x422E130CUL)))
#define bM4_TMR41_POCRU_PWMMD0                    (*((volatile unsigned int*)(0x422E1310UL)))
#define bM4_TMR41_POCRU_PWMMD1                    (*((volatile unsigned int*)(0x422E1314UL)))
#define bM4_TMR41_POCRU_LVLS0                     (*((volatile unsigned int*)(0x422E1318UL)))
#define bM4_TMR41_POCRU_LVLS1                     (*((volatile unsigned int*)(0x422E131CUL)))
#define bM4_TMR41_POCRV_DIVCK0                    (*((volatile unsigned int*)(0x422E1380UL)))
#define bM4_TMR41_POCRV_DIVCK1                    (*((volatile unsigned int*)(0x422E1384UL)))
#define bM4_TMR41_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x422E1388UL)))
#define bM4_TMR41_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x422E138CUL)))
#define bM4_TMR41_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x422E1390UL)))
#define bM4_TMR41_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x422E1394UL)))
#define bM4_TMR41_POCRV_LVLS0                     (*((volatile unsigned int*)(0x422E1398UL)))
#define bM4_TMR41_POCRV_LVLS1                     (*((volatile unsigned int*)(0x422E139CUL)))
#define bM4_TMR41_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x422E1400UL)))
#define bM4_TMR41_POCRW_DIVCK1                    (*((volatile unsigned int*)(0x422E1404UL)))
#define bM4_TMR41_POCRW_DIVCK2                    (*((volatile unsigned int*)(0x422E1408UL)))
#define bM4_TMR41_POCRW_DIVCK3                    (*((volatile unsigned int*)(0x422E140CUL)))
#define bM4_TMR41_POCRW_PWMMD0                    (*((volatile unsigned int*)(0x422E1410UL)))
#define bM4_TMR41_POCRW_PWMMD1                    (*((volatile unsigned int*)(0x422E1414UL)))
#define bM4_TMR41_POCRW_LVLS0                     (*((volatile unsigned int*)(0x422E1418UL)))
#define bM4_TMR41_POCRW_LVLS1                     (*((volatile unsigned int*)(0x422E141CUL)))
#define bM4_TMR41_RCSR_RTIDU                      (*((volatile unsigned int*)(0x422E1480UL)))
#define bM4_TMR41_RCSR_RTIDV                      (*((volatile unsigned int*)(0x422E1484UL)))
#define bM4_TMR41_RCSR_RTIDW                      (*((volatile unsigned int*)(0x422E1488UL)))
#define bM4_TMR41_RCSR_RTIFU                      (*((volatile unsigned int*)(0x422E1490UL)))
#define bM4_TMR41_RCSR_RTICU                      (*((volatile unsigned int*)(0x422E1494UL)))
#define bM4_TMR41_RCSR_RTEU                       (*((volatile unsigned int*)(0x422E1498UL)))
#define bM4_TMR41_RCSR_RTSU                       (*((volatile unsigned int*)(0x422E149CUL)))
#define bM4_TMR41_RCSR_RTIFV                      (*((volatile unsigned int*)(0x422E14A0UL)))
#define bM4_TMR41_RCSR_RTICV                      (*((volatile unsigned int*)(0x422E14A4UL)))
#define bM4_TMR41_RCSR_RTEV                       (*((volatile unsigned int*)(0x422E14A8UL)))
#define bM4_TMR41_RCSR_RTSV                       (*((volatile unsigned int*)(0x422E14ACUL)))
#define bM4_TMR41_RCSR_RTIFW                      (*((volatile unsigned int*)(0x422E14B0UL)))
#define bM4_TMR41_RCSR_RTICW                      (*((volatile unsigned int*)(0x422E14B4UL)))
#define bM4_TMR41_RCSR_RTEW                       (*((volatile unsigned int*)(0x422E14B8UL)))
#define bM4_TMR41_RCSR_RTSW                       (*((volatile unsigned int*)(0x422E14BCUL)))
#define bM4_TMR41_SCSRUH_BUFEN0                   (*((volatile unsigned int*)(0x422E1900UL)))
#define bM4_TMR41_SCSRUH_BUFEN1                   (*((volatile unsigned int*)(0x422E1904UL)))
#define bM4_TMR41_SCSRUH_EVTOS0                   (*((volatile unsigned int*)(0x422E1908UL)))
#define bM4_TMR41_SCSRUH_EVTOS1                   (*((volatile unsigned int*)(0x422E190CUL)))
#define bM4_TMR41_SCSRUH_EVTOS2                   (*((volatile unsigned int*)(0x422E1910UL)))
#define bM4_TMR41_SCSRUH_LMC                      (*((volatile unsigned int*)(0x422E1914UL)))
#define bM4_TMR41_SCSRUH_EVTMS                    (*((volatile unsigned int*)(0x422E1920UL)))
#define bM4_TMR41_SCSRUH_EVTDS                    (*((volatile unsigned int*)(0x422E1924UL)))
#define bM4_TMR41_SCSRUH_DEN                      (*((volatile unsigned int*)(0x422E1930UL)))
#define bM4_TMR41_SCSRUH_PEN                      (*((volatile unsigned int*)(0x422E1934UL)))
#define bM4_TMR41_SCSRUH_UEN                      (*((volatile unsigned int*)(0x422E1938UL)))
#define bM4_TMR41_SCSRUH_ZEN                      (*((volatile unsigned int*)(0x422E193CUL)))
#define bM4_TMR41_SCMRUH_AMC0                     (*((volatile unsigned int*)(0x422E1940UL)))
#define bM4_TMR41_SCMRUH_AMC1                     (*((volatile unsigned int*)(0x422E1944UL)))
#define bM4_TMR41_SCMRUH_AMC2                     (*((volatile unsigned int*)(0x422E1948UL)))
#define bM4_TMR41_SCMRUH_AMC3                     (*((volatile unsigned int*)(0x422E194CUL)))
#define bM4_TMR41_SCMRUH_MZCE                     (*((volatile unsigned int*)(0x422E1958UL)))
#define bM4_TMR41_SCMRUH_MPCE                     (*((volatile unsigned int*)(0x422E195CUL)))
#define bM4_TMR41_SCSRUL_BUFEN0                   (*((volatile unsigned int*)(0x422E1980UL)))
#define bM4_TMR41_SCSRUL_BUFEN1                   (*((volatile unsigned int*)(0x422E1984UL)))
#define bM4_TMR41_SCSRUL_EVTOS0                   (*((volatile unsigned int*)(0x422E1988UL)))
#define bM4_TMR41_SCSRUL_EVTOS1                   (*((volatile unsigned int*)(0x422E198CUL)))
#define bM4_TMR41_SCSRUL_EVTOS2                   (*((volatile unsigned int*)(0x422E1990UL)))
#define bM4_TMR41_SCSRUL_LMC                      (*((volatile unsigned int*)(0x422E1994UL)))
#define bM4_TMR41_SCSRUL_EVTMS                    (*((volatile unsigned int*)(0x422E19A0UL)))
#define bM4_TMR41_SCSRUL_EVTDS                    (*((volatile unsigned int*)(0x422E19A4UL)))
#define bM4_TMR41_SCSRUL_DEN                      (*((volatile unsigned int*)(0x422E19B0UL)))
#define bM4_TMR41_SCSRUL_PEN                      (*((volatile unsigned int*)(0x422E19B4UL)))
#define bM4_TMR41_SCSRUL_UEN                      (*((volatile unsigned int*)(0x422E19B8UL)))
#define bM4_TMR41_SCSRUL_ZEN                      (*((volatile unsigned int*)(0x422E19BCUL)))
#define bM4_TMR41_SCMRUL_AMC0                     (*((volatile unsigned int*)(0x422E19C0UL)))
#define bM4_TMR41_SCMRUL_AMC1                     (*((volatile unsigned int*)(0x422E19C4UL)))
#define bM4_TMR41_SCMRUL_AMC2                     (*((volatile unsigned int*)(0x422E19C8UL)))
#define bM4_TMR41_SCMRUL_AMC3                     (*((volatile unsigned int*)(0x422E19CCUL)))
#define bM4_TMR41_SCMRUL_MZCE                     (*((volatile unsigned int*)(0x422E19D8UL)))
#define bM4_TMR41_SCMRUL_MPCE                     (*((volatile unsigned int*)(0x422E19DCUL)))
#define bM4_TMR41_SCSRVH_BUFEN0                   (*((volatile unsigned int*)(0x422E1A00UL)))
#define bM4_TMR41_SCSRVH_BUFEN1                   (*((volatile unsigned int*)(0x422E1A04UL)))
#define bM4_TMR41_SCSRVH_EVTOS0                   (*((volatile unsigned int*)(0x422E1A08UL)))
#define bM4_TMR41_SCSRVH_EVTOS1                   (*((volatile unsigned int*)(0x422E1A0CUL)))
#define bM4_TMR41_SCSRVH_EVTOS2                   (*((volatile unsigned int*)(0x422E1A10UL)))
#define bM4_TMR41_SCSRVH_LMC                      (*((volatile unsigned int*)(0x422E1A14UL)))
#define bM4_TMR41_SCSRVH_EVTMS                    (*((volatile unsigned int*)(0x422E1A20UL)))
#define bM4_TMR41_SCSRVH_EVTDS                    (*((volatile unsigned int*)(0x422E1A24UL)))
#define bM4_TMR41_SCSRVH_DEN                      (*((volatile unsigned int*)(0x422E1A30UL)))
#define bM4_TMR41_SCSRVH_PEN                      (*((volatile unsigned int*)(0x422E1A34UL)))
#define bM4_TMR41_SCSRVH_UEN                      (*((volatile unsigned int*)(0x422E1A38UL)))
#define bM4_TMR41_SCSRVH_ZEN                      (*((volatile unsigned int*)(0x422E1A3CUL)))
#define bM4_TMR41_SCMRVH_AMC0                     (*((volatile unsigned int*)(0x422E1A40UL)))
#define bM4_TMR41_SCMRVH_AMC1                     (*((volatile unsigned int*)(0x422E1A44UL)))
#define bM4_TMR41_SCMRVH_AMC2                     (*((volatile unsigned int*)(0x422E1A48UL)))
#define bM4_TMR41_SCMRVH_AMC3                     (*((volatile unsigned int*)(0x422E1A4CUL)))
#define bM4_TMR41_SCMRVH_MZCE                     (*((volatile unsigned int*)(0x422E1A58UL)))
#define bM4_TMR41_SCMRVH_MPCE                     (*((volatile unsigned int*)(0x422E1A5CUL)))
#define bM4_TMR41_SCSRVL_BUFEN0                   (*((volatile unsigned int*)(0x422E1A80UL)))
#define bM4_TMR41_SCSRVL_BUFEN1                   (*((volatile unsigned int*)(0x422E1A84UL)))
#define bM4_TMR41_SCSRVL_EVTOS0                   (*((volatile unsigned int*)(0x422E1A88UL)))
#define bM4_TMR41_SCSRVL_EVTOS1                   (*((volatile unsigned int*)(0x422E1A8CUL)))
#define bM4_TMR41_SCSRVL_EVTOS2                   (*((volatile unsigned int*)(0x422E1A90UL)))
#define bM4_TMR41_SCSRVL_LMC                      (*((volatile unsigned int*)(0x422E1A94UL)))
#define bM4_TMR41_SCSRVL_EVTMS                    (*((volatile unsigned int*)(0x422E1AA0UL)))
#define bM4_TMR41_SCSRVL_EVTDS                    (*((volatile unsigned int*)(0x422E1AA4UL)))
#define bM4_TMR41_SCSRVL_DEN                      (*((volatile unsigned int*)(0x422E1AB0UL)))
#define bM4_TMR41_SCSRVL_PEN                      (*((volatile unsigned int*)(0x422E1AB4UL)))
#define bM4_TMR41_SCSRVL_UEN                      (*((volatile unsigned int*)(0x422E1AB8UL)))
#define bM4_TMR41_SCSRVL_ZEN                      (*((volatile unsigned int*)(0x422E1ABCUL)))
#define bM4_TMR41_SCMRVL_AMC0                     (*((volatile unsigned int*)(0x422E1AC0UL)))
#define bM4_TMR41_SCMRVL_AMC1                     (*((volatile unsigned int*)(0x422E1AC4UL)))
#define bM4_TMR41_SCMRVL_AMC2                     (*((volatile unsigned int*)(0x422E1AC8UL)))
#define bM4_TMR41_SCMRVL_AMC3                     (*((volatile unsigned int*)(0x422E1ACCUL)))
#define bM4_TMR41_SCMRVL_MZCE                     (*((volatile unsigned int*)(0x422E1AD8UL)))
#define bM4_TMR41_SCMRVL_MPCE                     (*((volatile unsigned int*)(0x422E1ADCUL)))
#define bM4_TMR41_SCSRWH_BUFEN0                   (*((volatile unsigned int*)(0x422E1B00UL)))
#define bM4_TMR41_SCSRWH_BUFEN1                   (*((volatile unsigned int*)(0x422E1B04UL)))
#define bM4_TMR41_SCSRWH_EVTOS0                   (*((volatile unsigned int*)(0x422E1B08UL)))
#define bM4_TMR41_SCSRWH_EVTOS1                   (*((volatile unsigned int*)(0x422E1B0CUL)))
#define bM4_TMR41_SCSRWH_EVTOS2                   (*((volatile unsigned int*)(0x422E1B10UL)))
#define bM4_TMR41_SCSRWH_LMC                      (*((volatile unsigned int*)(0x422E1B14UL)))
#define bM4_TMR41_SCSRWH_EVTMS                    (*((volatile unsigned int*)(0x422E1B20UL)))
#define bM4_TMR41_SCSRWH_EVTDS                    (*((volatile unsigned int*)(0x422E1B24UL)))
#define bM4_TMR41_SCSRWH_DEN                      (*((volatile unsigned int*)(0x422E1B30UL)))
#define bM4_TMR41_SCSRWH_PEN                      (*((volatile unsigned int*)(0x422E1B34UL)))
#define bM4_TMR41_SCSRWH_UEN                      (*((volatile unsigned int*)(0x422E1B38UL)))
#define bM4_TMR41_SCSRWH_ZEN                      (*((volatile unsigned int*)(0x422E1B3CUL)))
#define bM4_TMR41_SCMRWH_AMC0                     (*((volatile unsigned int*)(0x422E1B40UL)))
#define bM4_TMR41_SCMRWH_AMC1                     (*((volatile unsigned int*)(0x422E1B44UL)))
#define bM4_TMR41_SCMRWH_AMC2                     (*((volatile unsigned int*)(0x422E1B48UL)))
#define bM4_TMR41_SCMRWH_AMC3                     (*((volatile unsigned int*)(0x422E1B4CUL)))
#define bM4_TMR41_SCMRWH_MZCE                     (*((volatile unsigned int*)(0x422E1B58UL)))
#define bM4_TMR41_SCMRWH_MPCE                     (*((volatile unsigned int*)(0x422E1B5CUL)))
#define bM4_TMR41_SCSRWL_BUFEN0                   (*((volatile unsigned int*)(0x422E1B80UL)))
#define bM4_TMR41_SCSRWL_BUFEN1                   (*((volatile unsigned int*)(0x422E1B84UL)))
#define bM4_TMR41_SCSRWL_EVTOS0                   (*((volatile unsigned int*)(0x422E1B88UL)))
#define bM4_TMR41_SCSRWL_EVTOS1                   (*((volatile unsigned int*)(0x422E1B8CUL)))
#define bM4_TMR41_SCSRWL_EVTOS2                   (*((volatile unsigned int*)(0x422E1B90UL)))
#define bM4_TMR41_SCSRWL_LMC                      (*((volatile unsigned int*)(0x422E1B94UL)))
#define bM4_TMR41_SCSRWL_EVTMS                    (*((volatile unsigned int*)(0x422E1BA0UL)))
#define bM4_TMR41_SCSRWL_EVTDS                    (*((volatile unsigned int*)(0x422E1BA4UL)))
#define bM4_TMR41_SCSRWL_DEN                      (*((volatile unsigned int*)(0x422E1BB0UL)))
#define bM4_TMR41_SCSRWL_PEN                      (*((volatile unsigned int*)(0x422E1BB4UL)))
#define bM4_TMR41_SCSRWL_UEN                      (*((volatile unsigned int*)(0x422E1BB8UL)))
#define bM4_TMR41_SCSRWL_ZEN                      (*((volatile unsigned int*)(0x422E1BBCUL)))
#define bM4_TMR41_SCMRWL_AMC0                     (*((volatile unsigned int*)(0x422E1BC0UL)))
