SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/common/hc32f460kcta.h
#define bM4_TMR42_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x42491388UL)))
#define bM4_TMR42_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x4249138CUL)))
#define bM4_TMR42_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x42491390UL)))
#define bM4_TMR42_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x42491394UL)))
#define bM4_TMR42_POCRV_LVLS0                     (*((volatile unsigned int*)(0x42491398UL)))
#define bM4_TMR42_POCRV_LVLS1                     (*((volatile unsigned int*)(0x4249139CUL)))
#define bM4_TMR42_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x42491400UL)))
#define bM4_TMR42_POCRW_DIVCK1                    (*((volatile unsigned int*)(0x42491404UL)))
#define bM4_TMR42_POCRW_DIVCK2                    (*((volatile unsigned int*)(0x42491408UL)))
#define bM4_TMR42_POCRW_DIVCK3                    (*((volatile unsigned int*)(0x4249140CUL)))
#define bM4_TMR42_POCRW_PWMMD0                    (*((volatile unsigned int*)(0x42491410UL)))
#define bM4_TMR42_POCRW_PWMMD1                    (*((volatile unsigned int*)(0x42491414UL)))
#define bM4_TMR42_POCRW_LVLS0                     (*((volatile unsigned int*)(0x42491418UL)))
#define bM4_TMR42_POCRW_LVLS1                     (*((volatile unsigned int*)(0x4249141CUL)))
#define bM4_TMR42_RCSR_RTIDU                      (*((volatile unsigned int*)(0x42491480UL)))
#define bM4_TMR42_RCSR_RTIDV                      (*((volatile unsigned int*)(0x42491484UL)))
#define bM4_TMR42_RCSR_RTIDW                      (*((volatile unsigned int*)(0x42491488UL)))
#define bM4_TMR42_RCSR_RTIFU                      (*((volatile unsigned int*)(0x42491490UL)))
#define bM4_TMR42_RCSR_RTICU                      (*((volatile unsigned int*)(0x42491494UL)))
#define bM4_TMR42_RCSR_RTEU                       (*((volatile unsigned int*)(0x42491498UL)))
#define bM4_TMR42_RCSR_RTSU                       (*((volatile unsigned int*)(0x4249149CUL)))
#define bM4_TMR42_RCSR_RTIFV                      (*((volatile unsigned int*)(0x424914A0UL)))
#define bM4_TMR42_RCSR_RTICV                      (*((volatile unsigned int*)(0x424914A4UL)))
#define bM4_TMR42_RCSR_RTEV                       (*((volatile unsigned int*)(0x424914A8UL)))
#define bM4_TMR42_RCSR_RTSV                       (*((volatile unsigned int*)(0x424914ACUL)))
#define bM4_TMR42_RCSR_RTIFW                      (*((volatile unsigned int*)(0x424914B0UL)))
#define bM4_TMR42_RCSR_RTICW                      (*((volatile unsigned int*)(0x424914B4UL)))
#define bM4_TMR42_RCSR_RTEW                       (*((volatile unsigned int*)(0x424914B8UL)))
#define bM4_TMR42_RCSR_RTSW                       (*((volatile unsigned int*)(0x424914BCUL)))
#define bM4_TMR42_SCSRUH_BUFEN0                   (*((volatile unsigned int*)(0x42491900UL)))
#define bM4_TMR42_SCSRUH_BUFEN1                   (*((volatile unsigned int*)(0x42491904UL)))
#define bM4_TMR42_SCSRUH_EVTOS0                   (*((volatile unsigned int*)(0x42491908UL)))
#define bM4_TMR42_SCSRUH_EVTOS1                   (*((volatile unsigned int*)(0x4249190CUL)))
#define bM4_TMR42_SCSRUH_EVTOS2                   (*((volatile unsigned int*)(0x42491910UL)))
#define bM4_TMR42_SCSRUH_LMC                      (*((volatile unsigned int*)(0x42491914UL)))
#define bM4_TMR42_SCSRUH_EVTMS                    (*((volatile unsigned int*)(0x42491920UL)))
#define bM4_TMR42_SCSRUH_EVTDS                    (*((volatile unsigned int*)(0x42491924UL)))
#define bM4_TMR42_SCSRUH_DEN                      (*((volatile unsigned int*)(0x42491930UL)))
#define bM4_TMR42_SCSRUH_PEN                      (*((volatile unsigned int*)(0x42491934UL)))
#define bM4_TMR42_SCSRUH_UEN                      (*((volatile unsigned int*)(0x42491938UL)))
#define bM4_TMR42_SCSRUH_ZEN                      (*((volatile unsigned int*)(0x4249193CUL)))
#define bM4_TMR42_SCMRUH_AMC0                     (*((volatile unsigned int*)(0x42491940UL)))
#define bM4_TMR42_SCMRUH_AMC1                     (*((volatile unsigned int*)(0x42491944UL)))
#define bM4_TMR42_SCMRUH_AMC2                     (*((volatile unsigned int*)(0x42491948UL)))
#define bM4_TMR42_SCMRUH_AMC3                     (*((volatile unsigned int*)(0x4249194CUL)))
#define bM4_TMR42_SCMRUH_MZCE                     (*((volatile unsigned int*)(0x42491958UL)))
#define bM4_TMR42_SCMRUH_MPCE                     (*((volatile unsigned int*)(0x4249195CUL)))
#define bM4_TMR42_SCSRUL_BUFEN0                   (*((volatile unsigned int*)(0x42491980UL)))
#define bM4_TMR42_SCSRUL_BUFEN1                   (*((volatile unsigned int*)(0x42491984UL)))
#define bM4_TMR42_SCSRUL_EVTOS0                   (*((volatile unsigned int*)(0x42491988UL)))
#define bM4_TMR42_SCSRUL_EVTOS1                   (*((volatile unsigned int*)(0x4249198CUL)))
#define bM4_TMR42_SCSRUL_EVTOS2                   (*((volatile unsigned int*)(0x42491990UL)))
#define bM4_TMR42_SCSRUL_LMC                      (*((volatile unsigned int*)(0x42491994UL)))
#define bM4_TMR42_SCSRUL_EVTMS                    (*((volatile unsigned int*)(0x424919A0UL)))
#define bM4_TMR42_SCSRUL_EVTDS                    (*((volatile unsigned int*)(0x424919A4UL)))
#define bM4_TMR42_SCSRUL_DEN                      (*((volatile unsigned int*)(0x424919B0UL)))
#define bM4_TMR42_SCSRUL_PEN                      (*((volatile unsigned int*)(0x424919B4UL)))
#define bM4_TMR42_SCSRUL_UEN                      (*((volatile unsigned int*)(0x424919B8UL)))
#define bM4_TMR42_SCSRUL_ZEN                      (*((volatile unsigned int*)(0x424919BCUL)))
#define bM4_TMR42_SCMRUL_AMC0                     (*((volatile unsigned int*)(0x424919C0UL)))
#define bM4_TMR42_SCMRUL_AMC1                     (*((volatile unsigned int*)(0x424919C4UL)))
#define bM4_TMR42_SCMRUL_AMC2                     (*((volatile unsigned int*)(0x424919C8UL)))
#define bM4_TMR42_SCMRUL_AMC3                     (*((volatile unsigned int*)(0x424919CCUL)))
#define bM4_TMR42_SCMRUL_MZCE                     (*((volatile unsigned int*)(0x424919D8UL)))
#define bM4_TMR42_SCMRUL_MPCE                     (*((volatile unsigned int*)(0x424919DCUL)))
#define bM4_TMR42_SCSRVH_BUFEN0                   (*((volatile unsigned int*)(0x42491A00UL)))
#define bM4_TMR42_SCSRVH_BUFEN1                   (*((volatile unsigned int*)(0x42491A04UL)))
#define bM4_TMR42_SCSRVH_EVTOS0                   (*((volatile unsigned int*)(0x42491A08UL)))
#define bM4_TMR42_SCSRVH_EVTOS1                   (*((volatile unsigned int*)(0x42491A0CUL)))
#define bM4_TMR42_SCSRVH_EVTOS2                   (*((volatile unsigned int*)(0x42491A10UL)))
#define bM4_TMR42_SCSRVH_LMC                      (*((volatile unsigned int*)(0x42491A14UL)))
#define bM4_TMR42_SCSRVH_EVTMS                    (*((volatile unsigned int*)(0x42491A20UL)))
#define bM4_TMR42_SCSRVH_EVTDS                    (*((volatile unsigned int*)(0x42491A24UL)))
#define bM4_TMR42_SCSRVH_DEN                      (*((volatile unsigned int*)(0x42491A30UL)))
#define bM4_TMR42_SCSRVH_PEN                      (*((volatile unsigned int*)(0x42491A34UL)))
#define bM4_TMR42_SCSRVH_UEN                      (*((volatile unsigned int*)(0x42491A38UL)))
#define bM4_TMR42_SCSRVH_ZEN                      (*((volatile unsigned int*)(0x42491A3CUL)))
#define bM4_TMR42_SCMRVH_AMC0                     (*((volatile unsigned int*)(0x42491A40UL)))
#define bM4_TMR42_SCMRVH_AMC1                     (*((volatile unsigned int*)(0x42491A44UL)))
#define bM4_TMR42_SCMRVH_AMC2                     (*((volatile unsigned int*)(0x42491A48UL)))
#define bM4_TMR42_SCMRVH_AMC3                     (*((volatile unsigned int*)(0x42491A4CUL)))
#define bM4_TMR42_SCMRVH_MZCE                     (*((volatile unsigned int*)(0x42491A58UL)))
#define bM4_TMR42_SCMRVH_MPCE                     (*((volatile unsigned int*)(0x42491A5CUL)))
#define bM4_TMR42_SCSRVL_BUFEN0                   (*((volatile unsigned int*)(0x42491A80UL)))
#define bM4_TMR42_SCSRVL_BUFEN1                   (*((volatile unsigned int*)(0x42491A84UL)))
#define bM4_TMR42_SCSRVL_EVTOS0                   (*((volatile unsigned int*)(0x42491A88UL)))
#define bM4_TMR42_SCSRVL_EVTOS1                   (*((volatile unsigned int*)(0x42491A8CUL)))
#define bM4_TMR42_SCSRVL_EVTOS2                   (*((volatile unsigned int*)(0x42491A90UL)))
#define bM4_TMR42_SCSRVL_LMC                      (*((volatile unsigned int*)(0x42491A94UL)))
#define bM4_TMR42_SCSRVL_EVTMS                    (*((volatile unsigned int*)(0x42491AA0UL)))
#define bM4_TMR42_SCSRVL_EVTDS                    (*((volatile unsigned int*)(0x42491AA4UL)))
#define bM4_TMR42_SCSRVL_DEN                      (*((volatile unsigned int*)(0x42491AB0UL)))
#define bM4_TMR42_SCSRVL_PEN                      (*((volatile unsigned int*)(0x42491AB4UL)))
#define bM4_TMR42_SCSRVL_UEN                      (*((volatile unsigned int*)(0x42491AB8UL)))
#define bM4_TMR42_SCSRVL_ZEN                      (*((volatile unsigned int*)(0x42491ABCUL)))
#define bM4_TMR42_SCMRVL_AMC0                     (*((volatile unsigned int*)(0x42491AC0UL)))
#define bM4_TMR42_SCMRVL_AMC1                     (*((volatile unsigned int*)(0x42491AC4UL)))
#define bM4_TMR42_SCMRVL_AMC2                     (*((volatile unsigned int*)(0x42491AC8UL)))
#define bM4_TMR42_SCMRVL_AMC3                     (*((volatile unsigned int*)(0x42491ACCUL)))
#define bM4_TMR42_SCMRVL_MZCE                     (*((volatile unsigned int*)(0x42491AD8UL)))
#define bM4_TMR42_SCMRVL_MPCE                     (*((volatile unsigned int*)(0x42491ADCUL)))
#define bM4_TMR42_SCSRWH_BUFEN0                   (*((volatile unsigned int*)(0x42491B00UL)))
#define bM4_TMR42_SCSRWH_BUFEN1                   (*((volatile unsigned int*)(0x42491B04UL)))
#define bM4_TMR42_SCSRWH_EVTOS0                   (*((volatile unsigned int*)(0x42491B08UL)))
#define bM4_TMR42_SCSRWH_EVTOS1                   (*((volatile unsigned int*)(0x42491B0CUL)))
#define bM4_TMR42_SCSRWH_EVTOS2                   (*((volatile unsigned int*)(0x42491B10UL)))
#define bM4_TMR42_SCSRWH_LMC                      (*((volatile unsigned int*)(0x42491B14UL)))
#define bM4_TMR42_SCSRWH_EVTMS                    (*((volatile unsigned int*)(0x42491B20UL)))
#define bM4_TMR42_SCSRWH_EVTDS                    (*((volatile unsigned int*)(0x42491B24UL)))
#define bM4_TMR42_SCSRWH_DEN                      (*((volatile unsigned int*)(0x42491B30UL)))
#define bM4_TMR42_SCSRWH_PEN                      (*((volatile unsigned int*)(0x42491B34UL)))
#define bM4_TMR42_SCSRWH_UEN                      (*((volatile unsigned int*)(0x42491B38UL)))
#define bM4_TMR42_SCSRWH_ZEN                      (*((volatile unsigned int*)(0x42491B3CUL)))
#define bM4_TMR42_SCMRWH_AMC0                     (*((volatile unsigned int*)(0x42491B40UL)))
#define bM4_TMR42_SCMRWH_AMC1                     (*((volatile unsigned int*)(0x42491B44UL)))
#define bM4_TMR42_SCMRWH_AMC2                     (*((volatile unsigned int*)(0x42491B48UL)))
#define bM4_TMR42_SCMRWH_AMC3                     (*((volatile unsigned int*)(0x42491B4CUL)))
#define bM4_TMR42_SCMRWH_MZCE                     (*((volatile unsigned int*)(0x42491B58UL)))
#define bM4_TMR42_SCMRWH_MPCE                     (*((volatile unsigned int*)(0x42491B5CUL)))
#define bM4_TMR42_SCSRWL_BUFEN0                   (*((volatile unsigned int*)(0x42491B80UL)))
#define bM4_TMR42_SCSRWL_BUFEN1                   (*((volatile unsigned int*)(0x42491B84UL)))
#define bM4_TMR42_SCSRWL_EVTOS0                   (*((volatile unsigned int*)(0x42491B88UL)))
#define bM4_TMR42_SCSRWL_EVTOS1                   (*((volatile unsigned int*)(0x42491B8CUL)))
#define bM4_TMR42_SCSRWL_EVTOS2                   (*((volatile unsigned int*)(0x42491B90UL)))
#define bM4_TMR42_SCSRWL_LMC                      (*((volatile unsigned int*)(0x42491B94UL)))
#define bM4_TMR42_SCSRWL_EVTMS                    (*((volatile unsigned int*)(0x42491BA0UL)))
#define bM4_TMR42_SCSRWL_EVTDS                    (*((volatile unsigned int*)(0x42491BA4UL)))
#define bM4_TMR42_SCSRWL_DEN                      (*((volatile unsigned int*)(0x42491BB0UL)))
#define bM4_TMR42_SCSRWL_PEN                      (*((volatile unsigned int*)(0x42491BB4UL)))
#define bM4_TMR42_SCSRWL_UEN                      (*((volatile unsigned int*)(0x42491BB8UL)))
#define bM4_TMR42_SCSRWL_ZEN                      (*((volatile unsigned int*)(0x42491BBCUL)))
#define bM4_TMR42_SCMRWL_AMC0                     (*((volatile unsigned int*)(0x42491BC0UL)))
#define bM4_TMR42_SCMRWL_AMC1                     (*((volatile unsigned int*)(0x42491BC4UL)))
#define bM4_TMR42_SCMRWL_AMC2                     (*((volatile unsigned int*)(0x42491BC8UL)))
#define bM4_TMR42_SCMRWL_AMC3                     (*((volatile unsigned int*)(0x42491BCCUL)))
#define bM4_TMR42_SCMRWL_MZCE                     (*((volatile unsigned int*)(0x42491BD8UL)))
#define bM4_TMR42_SCMRWL_MPCE                     (*((volatile unsigned int*)(0x42491BDCUL)))
#define bM4_TMR42_ECSR_HOLD                       (*((volatile unsigned int*)(0x42491E1CUL)))
#define bM4_TMR43_OCSRU_OCEH                      (*((volatile unsigned int*)(0x42498300UL)))
#define bM4_TMR43_OCSRU_OCEL                      (*((volatile unsigned int*)(0x42498304UL)))
#define bM4_TMR43_OCSRU_OCPH                      (*((volatile unsigned int*)(0x42498308UL)))
#define bM4_TMR43_OCSRU_OCPL                      (*((volatile unsigned int*)(0x4249830CUL)))
#define bM4_TMR43_OCSRU_OCIEH                     (*((volatile unsigned int*)(0x42498310UL)))
#define bM4_TMR43_OCSRU_OCIEL                     (*((volatile unsigned int*)(0x42498314UL)))
#define bM4_TMR43_OCSRU_OCFH                      (*((volatile unsigned int*)(0x42498318UL)))
#define bM4_TMR43_OCSRU_OCFL                      (*((volatile unsigned int*)(0x4249831CUL)))
#define bM4_TMR43_OCERU_CHBUFEN0                  (*((volatile unsigned int*)(0x42498340UL)))
#define bM4_TMR43_OCERU_CHBUFEN1                  (*((volatile unsigned int*)(0x42498344UL)))
#define bM4_TMR43_OCERU_CLBUFEN0                  (*((volatile unsigned int*)(0x42498348UL)))
#define bM4_TMR43_OCERU_CLBUFEN1                  (*((volatile unsigned int*)(0x4249834CUL)))
#define bM4_TMR43_OCERU_MHBUFEN0                  (*((volatile unsigned int*)(0x42498350UL)))
#define bM4_TMR43_OCERU_MHBUFEN1                  (*((volatile unsigned int*)(0x42498354UL)))
#define bM4_TMR43_OCERU_MLBUFEN0                  (*((volatile unsigned int*)(0x42498358UL)))
#define bM4_TMR43_OCERU_MLBUFEN1                  (*((volatile unsigned int*)(0x4249835CUL)))
#define bM4_TMR43_OCERU_LMCH                      (*((volatile unsigned int*)(0x42498360UL)))
#define bM4_TMR43_OCERU_LMCL                      (*((volatile unsigned int*)(0x42498364UL)))
#define bM4_TMR43_OCERU_LMMH                      (*((volatile unsigned int*)(0x42498368UL)))
#define bM4_TMR43_OCERU_LMML                      (*((volatile unsigned int*)(0x4249836CUL)))
#define bM4_TMR43_OCERU_MCECH                     (*((volatile unsigned int*)(0x42498370UL)))
#define bM4_TMR43_OCERU_MCECL                     (*((volatile unsigned int*)(0x42498374UL)))
#define bM4_TMR43_OCSRV_OCEH                      (*((volatile unsigned int*)(0x42498380UL)))
#define bM4_TMR43_OCSRV_OCEL                      (*((volatile unsigned int*)(0x42498384UL)))
#define bM4_TMR43_OCSRV_OCPH                      (*((volatile unsigned int*)(0x42498388UL)))
#define bM4_TMR43_OCSRV_OCPL                      (*((volatile unsigned int*)(0x4249838CUL)))
#define bM4_TMR43_OCSRV_OCIEH                     (*((volatile unsigned int*)(0x42498390UL)))
#define bM4_TMR43_OCSRV_OCIEL                     (*((volatile unsigned int*)(0x42498394UL)))
#define bM4_TMR43_OCSRV_OCFH                      (*((volatile unsigned int*)(0x42498398UL)))
#define bM4_TMR43_OCSRV_OCFL                      (*((volatile unsigned int*)(0x4249839CUL)))
#define bM4_TMR43_OCERV_CHBUFEN0                  (*((volatile unsigned int*)(0x424983C0UL)))
#define bM4_TMR43_OCERV_CHBUFEN1                  (*((volatile unsigned int*)(0x424983C4UL)))
#define bM4_TMR43_OCERV_CLBUFEN0                  (*((volatile unsigned int*)(0x424983C8UL)))
#define bM4_TMR43_OCERV_CLBUFEN1                  (*((volatile unsigned int*)(0x424983CCUL)))
#define bM4_TMR43_OCERV_MHBUFEN0                  (*((volatile unsigned int*)(0x424983D0UL)))
#define bM4_TMR43_OCERV_MHBUFEN1                  (*((volatile unsigned int*)(0x424983D4UL)))
#define bM4_TMR43_OCERV_MLBUFEN0                  (*((volatile unsigned int*)(0x424983D8UL)))
#define bM4_TMR43_OCERV_MLBUFEN1                  (*((volatile unsigned int*)(0x424983DCUL)))
#define bM4_TMR43_OCERV_LMCH                      (*((volatile unsigned int*)(0x424983E0UL)))
#define bM4_TMR43_OCERV_LMCL                      (*((volatile unsigned int*)(0x424983E4UL)))
#define bM4_TMR43_OCERV_LMMH                      (*((volatile unsigned int*)(0x424983E8UL)))
#define bM4_TMR43_OCERV_LMML                      (*((volatile unsigned int*)(0x424983ECUL)))
#define bM4_TMR43_OCERV_MCECH                     (*((volatile unsigned int*)(0x424983F0UL)))
#define bM4_TMR43_OCERV_MCECL                     (*((volatile unsigned int*)(0x424983F4UL)))
#define bM4_TMR43_OCSRW_OCEH                      (*((volatile unsigned int*)(0x42498400UL)))
#define bM4_TMR43_OCSRW_OCEL                      (*((volatile unsigned int*)(0x42498404UL)))
#define bM4_TMR43_OCSRW_OCPH                      (*((volatile unsigned int*)(0x42498408UL)))
#define bM4_TMR43_OCSRW_OCPL                      (*((volatile unsigned int*)(0x4249840CUL)))
#define bM4_TMR43_OCSRW_OCIEH                     (*((volatile unsigned int*)(0x42498410UL)))
#define bM4_TMR43_OCSRW_OCIEL                     (*((volatile unsigned int*)(0x42498414UL)))
#define bM4_TMR43_OCSRW_OCFH                      (*((volatile unsigned int*)(0x42498418UL)))
#define bM4_TMR43_OCSRW_OCFL                      (*((volatile unsigned int*)(0x4249841CUL)))
#define bM4_TMR43_OCERW_CHBUFEN0                  (*((volatile unsigned int*)(0x42498440UL)))
#define bM4_TMR43_OCERW_CHBUFEN1                  (*((volatile unsigned int*)(0x42498444UL)))
#define bM4_TMR43_OCERW_CLBUFEN0                  (*((volatile unsigned int*)(0x42498448UL)))
#define bM4_TMR43_OCERW_CLBUFEN1                  (*((volatile unsigned int*)(0x4249844CUL)))
#define bM4_TMR43_OCERW_MHBUFEN0                  (*((volatile unsigned int*)(0x42498450UL)))
#define bM4_TMR43_OCERW_MHBUFEN1                  (*((volatile unsigned int*)(0x42498454UL)))
#define bM4_TMR43_OCERW_MLBUFEN0                  (*((volatile unsigned int*)(0x42498458UL)))
#define bM4_TMR43_OCERW_MLBUFEN1                  (*((volatile unsigned int*)(0x4249845CUL)))
#define bM4_TMR43_OCERW_LMCH                      (*((volatile unsigned int*)(0x42498460UL)))
#define bM4_TMR43_OCERW_LMCL                      (*((volatile unsigned int*)(0x42498464UL)))
#define bM4_TMR43_OCERW_LMMH                      (*((volatile unsigned int*)(0x42498468UL)))
#define bM4_TMR43_OCERW_LMML                      (*((volatile unsigned int*)(0x4249846CUL)))
#define bM4_TMR43_OCERW_MCECH                     (*((volatile unsigned int*)(0x42498470UL)))
#define bM4_TMR43_OCERW_MCECL                     (*((volatile unsigned int*)(0x42498474UL)))
#define bM4_TMR43_OCMRHUH_OCFDCH                  (*((volatile unsigned int*)(0x42498480UL)))
#define bM4_TMR43_OCMRHUH_OCFPKH                  (*((volatile unsigned int*)(0x42498484UL)))
#define bM4_TMR43_OCMRHUH_OCFUCH                  (*((volatile unsigned int*)(0x42498488UL)))
#define bM4_TMR43_OCMRHUH_OCFZRH                  (*((volatile unsigned int*)(0x4249848CUL)))
#define bM4_TMR43_OCMRHUH_OPDCH0                  (*((volatile unsigned int*)(0x42498490UL)))
#define bM4_TMR43_OCMRHUH_OPDCH1                  (*((volatile unsigned int*)(0x42498494UL)))
#define bM4_TMR43_OCMRHUH_OPPKH0                  (*((volatile unsigned int*)(0x42498498UL)))
#define bM4_TMR43_OCMRHUH_OPPKH1                  (*((volatile unsigned int*)(0x4249849CUL)))
#define bM4_TMR43_OCMRHUH_OPUCH0                  (*((volatile unsigned int*)(0x424984A0UL)))
#define bM4_TMR43_OCMRHUH_OPUCH1                  (*((volatile unsigned int*)(0x424984A4UL)))
#define bM4_TMR43_OCMRHUH_OPZRH0                  (*((volatile unsigned int*)(0x424984A8UL)))
#define bM4_TMR43_OCMRHUH_OPZRH1                  (*((volatile unsigned int*)(0x424984ACUL)))
#define bM4_TMR43_OCMRHUH_OPNPKH0                 (*((volatile unsigned int*)(0x424984B0UL)))
#define bM4_TMR43_OCMRHUH_OPNPKH1                 (*((volatile unsigned int*)(0x424984B4UL)))
#define bM4_TMR43_OCMRHUH_OPNZRH0                 (*((volatile unsigned int*)(0x424984B8UL)))
#define bM4_TMR43_OCMRHUH_OPNZRH1                 (*((volatile unsigned int*)(0x424984BCUL)))
#define bM4_TMR43_OCMRLUL_OCFDCL                  (*((volatile unsigned int*)(0x42498500UL)))
#define bM4_TMR43_OCMRLUL_OCFPKL                  (*((volatile unsigned int*)(0x42498504UL)))
#define bM4_TMR43_OCMRLUL_OCFUCL                  (*((volatile unsigned int*)(0x42498508UL)))
#define bM4_TMR43_OCMRLUL_OCFZRL                  (*((volatile unsigned int*)(0x4249850CUL)))
#define bM4_TMR43_OCMRLUL_OPDCL0                  (*((volatile unsigned int*)(0x42498510UL)))
#define bM4_TMR43_OCMRLUL_OPDCL1                  (*((volatile unsigned int*)(0x42498514UL)))
#define bM4_TMR43_OCMRLUL_OPPKL0                  (*((volatile unsigned int*)(0x42498518UL)))
#define bM4_TMR43_OCMRLUL_OPPKL1                  (*((volatile unsigned int*)(0x4249851CUL)))
#define bM4_TMR43_OCMRLUL_OPUCL0                  (*((volatile unsigned int*)(0x42498520UL)))
#define bM4_TMR43_OCMRLUL_OPUCL1                  (*((volatile unsigned int*)(0x42498524UL)))
#define bM4_TMR43_OCMRLUL_OPZRL0                  (*((volatile unsigned int*)(0x42498528UL)))
#define bM4_TMR43_OCMRLUL_OPZRL1                  (*((volatile unsigned int*)(0x4249852CUL)))
#define bM4_TMR43_OCMRLUL_OPNPKL0                 (*((volatile unsigned int*)(0x42498530UL)))
#define bM4_TMR43_OCMRLUL_OPNPKL1                 (*((volatile unsigned int*)(0x42498534UL)))
#define bM4_TMR43_OCMRLUL_OPNZRL0                 (*((volatile unsigned int*)(0x42498538UL)))
#define bM4_TMR43_OCMRLUL_OPNZRL1                 (*((volatile unsigned int*)(0x4249853CUL)))
#define bM4_TMR43_OCMRLUL_EOPNDCL0                (*((volatile unsigned int*)(0x42498540UL)))
#define bM4_TMR43_OCMRLUL_EOPNDCL1                (*((volatile unsigned int*)(0x42498544UL)))
#define bM4_TMR43_OCMRLUL_EOPNUCL0                (*((volatile unsigned int*)(0x42498548UL)))
#define bM4_TMR43_OCMRLUL_EOPNUCL1                (*((volatile unsigned int*)(0x4249854CUL)))
#define bM4_TMR43_OCMRLUL_EOPDCL0                 (*((volatile unsigned int*)(0x42498550UL)))
#define bM4_TMR43_OCMRLUL_EOPDCL1                 (*((volatile unsigned int*)(0x42498554UL)))
#define bM4_TMR43_OCMRLUL_EOPPKL0                 (*((volatile unsigned int*)(0x42498558UL)))
#define bM4_TMR43_OCMRLUL_EOPPKL1                 (*((volatile unsigned int*)(0x4249855CUL)))
#define bM4_TMR43_OCMRLUL_EOPUCL0                 (*((volatile unsigned int*)(0x42498560UL)))
#define bM4_TMR43_OCMRLUL_EOPUCL1                 (*((volatile unsigned int*)(0x42498564UL)))
#define bM4_TMR43_OCMRLUL_EOPZRL0                 (*((volatile unsigned int*)(0x42498568UL)))
#define bM4_TMR43_OCMRLUL_EOPZRL1                 (*((volatile unsigned int*)(0x4249856CUL)))
#define bM4_TMR43_OCMRLUL_EOPNPKL0                (*((volatile unsigned int*)(0x42498570UL)))
#define bM4_TMR43_OCMRLUL_EOPNPKL1                (*((volatile unsigned int*)(0x42498574UL)))
#define bM4_TMR43_OCMRLUL_EOPNZRL0                (*((volatile unsigned int*)(0x42498578UL)))
#define bM4_TMR43_OCMRLUL_EOPNZRL1                (*((volatile unsigned int*)(0x4249857CUL)))
#define bM4_TMR43_OCMRHVH_OCFDCH                  (*((volatile unsigned int*)(0x42498580UL)))
#define bM4_TMR43_OCMRHVH_OCFPKH                  (*((volatile unsigned int*)(0x42498584UL)))
#define bM4_TMR43_OCMRHVH_OCFUCH                  (*((volatile unsigned int*)(0x42498588UL)))
