SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460kcta_template/common/hc32f460kcta.h
#define bM4_TMR62_SCMFR_SCMF2                     (*((volatile unsigned int*)(0x42308788UL)))
#define bM4_TMR62_SCMFR_SCMF3                     (*((volatile unsigned int*)(0x4230878CUL)))
#define bM4_TMR62_SCMFR_SCMF4                     (*((volatile unsigned int*)(0x42308790UL)))
#define bM4_TMR62_SCMFR_SCMF5                     (*((volatile unsigned int*)(0x42308794UL)))
#define bM4_TMR62_SCMFR_SCMF6                     (*((volatile unsigned int*)(0x42308798UL)))
#define bM4_TMR62_SCMFR_SCMF7                     (*((volatile unsigned int*)(0x4230879CUL)))
#define bM4_TMR62_SCMFR_SCMF8                     (*((volatile unsigned int*)(0x423087A0UL)))
#define bM4_TMR62_SCMFR_SCMF9                     (*((volatile unsigned int*)(0x423087A4UL)))
#define bM4_TMR62_SCMFR_SCMF10                    (*((volatile unsigned int*)(0x423087A8UL)))
#define bM4_TMR62_SCMFR_SCMF11                    (*((volatile unsigned int*)(0x423087ACUL)))
#define bM4_TMR62_SCMFR_SCMF12                    (*((volatile unsigned int*)(0x423087B0UL)))
#define bM4_TMR62_SCMFR_SCMF13                    (*((volatile unsigned int*)(0x423087B4UL)))
#define bM4_TMR62_SCMFR_SCMF14                    (*((volatile unsigned int*)(0x423087B8UL)))
#define bM4_TMR62_SCMFR_SCMF15                    (*((volatile unsigned int*)(0x423087BCUL)))
#define bM4_TMR62_DTUAR_DTUA0                     (*((volatile unsigned int*)(0x42308800UL)))
#define bM4_TMR62_DTUAR_DTUA1                     (*((volatile unsigned int*)(0x42308804UL)))
#define bM4_TMR62_DTUAR_DTUA2                     (*((volatile unsigned int*)(0x42308808UL)))
#define bM4_TMR62_DTUAR_DTUA3                     (*((volatile unsigned int*)(0x4230880CUL)))
#define bM4_TMR62_DTUAR_DTUA4                     (*((volatile unsigned int*)(0x42308810UL)))
#define bM4_TMR62_DTUAR_DTUA5                     (*((volatile unsigned int*)(0x42308814UL)))
#define bM4_TMR62_DTUAR_DTUA6                     (*((volatile unsigned int*)(0x42308818UL)))
#define bM4_TMR62_DTUAR_DTUA7                     (*((volatile unsigned int*)(0x4230881CUL)))
#define bM4_TMR62_DTUAR_DTUA8                     (*((volatile unsigned int*)(0x42308820UL)))
#define bM4_TMR62_DTUAR_DTUA9                     (*((volatile unsigned int*)(0x42308824UL)))
#define bM4_TMR62_DTUAR_DTUA10                    (*((volatile unsigned int*)(0x42308828UL)))
#define bM4_TMR62_DTUAR_DTUA11                    (*((volatile unsigned int*)(0x4230882CUL)))
#define bM4_TMR62_DTUAR_DTUA12                    (*((volatile unsigned int*)(0x42308830UL)))
#define bM4_TMR62_DTUAR_DTUA13                    (*((volatile unsigned int*)(0x42308834UL)))
#define bM4_TMR62_DTUAR_DTUA14                    (*((volatile unsigned int*)(0x42308838UL)))
#define bM4_TMR62_DTUAR_DTUA15                    (*((volatile unsigned int*)(0x4230883CUL)))
#define bM4_TMR62_DTDAR_DTDA0                     (*((volatile unsigned int*)(0x42308880UL)))
#define bM4_TMR62_DTDAR_DTDA1                     (*((volatile unsigned int*)(0x42308884UL)))
#define bM4_TMR62_DTDAR_DTDA2                     (*((volatile unsigned int*)(0x42308888UL)))
#define bM4_TMR62_DTDAR_DTDA3                     (*((volatile unsigned int*)(0x4230888CUL)))
#define bM4_TMR62_DTDAR_DTDA4                     (*((volatile unsigned int*)(0x42308890UL)))
#define bM4_TMR62_DTDAR_DTDA5                     (*((volatile unsigned int*)(0x42308894UL)))
#define bM4_TMR62_DTDAR_DTDA6                     (*((volatile unsigned int*)(0x42308898UL)))
#define bM4_TMR62_DTDAR_DTDA7                     (*((volatile unsigned int*)(0x4230889CUL)))
#define bM4_TMR62_DTDAR_DTDA8                     (*((volatile unsigned int*)(0x423088A0UL)))
#define bM4_TMR62_DTDAR_DTDA9                     (*((volatile unsigned int*)(0x423088A4UL)))
#define bM4_TMR62_DTDAR_DTDA10                    (*((volatile unsigned int*)(0x423088A8UL)))
#define bM4_TMR62_DTDAR_DTDA11                    (*((volatile unsigned int*)(0x423088ACUL)))
#define bM4_TMR62_DTDAR_DTDA12                    (*((volatile unsigned int*)(0x423088B0UL)))
#define bM4_TMR62_DTDAR_DTDA13                    (*((volatile unsigned int*)(0x423088B4UL)))
#define bM4_TMR62_DTDAR_DTDA14                    (*((volatile unsigned int*)(0x423088B8UL)))
#define bM4_TMR62_DTDAR_DTDA15                    (*((volatile unsigned int*)(0x423088BCUL)))
#define bM4_TMR62_DTUBR_DTUB0                     (*((volatile unsigned int*)(0x42308900UL)))
#define bM4_TMR62_DTUBR_DTUB1                     (*((volatile unsigned int*)(0x42308904UL)))
#define bM4_TMR62_DTUBR_DTUB2                     (*((volatile unsigned int*)(0x42308908UL)))
#define bM4_TMR62_DTUBR_DTUB3                     (*((volatile unsigned int*)(0x4230890CUL)))
#define bM4_TMR62_DTUBR_DTUB4                     (*((volatile unsigned int*)(0x42308910UL)))
#define bM4_TMR62_DTUBR_DTUB5                     (*((volatile unsigned int*)(0x42308914UL)))
#define bM4_TMR62_DTUBR_DTUB6                     (*((volatile unsigned int*)(0x42308918UL)))
#define bM4_TMR62_DTUBR_DTUB7                     (*((volatile unsigned int*)(0x4230891CUL)))
#define bM4_TMR62_DTUBR_DTUB8                     (*((volatile unsigned int*)(0x42308920UL)))
#define bM4_TMR62_DTUBR_DTUB9                     (*((volatile unsigned int*)(0x42308924UL)))
#define bM4_TMR62_DTUBR_DTUB10                    (*((volatile unsigned int*)(0x42308928UL)))
#define bM4_TMR62_DTUBR_DTUB11                    (*((volatile unsigned int*)(0x4230892CUL)))
#define bM4_TMR62_DTUBR_DTUB12                    (*((volatile unsigned int*)(0x42308930UL)))
#define bM4_TMR62_DTUBR_DTUB13                    (*((volatile unsigned int*)(0x42308934UL)))
#define bM4_TMR62_DTUBR_DTUB14                    (*((volatile unsigned int*)(0x42308938UL)))
#define bM4_TMR62_DTUBR_DTUB15                    (*((volatile unsigned int*)(0x4230893CUL)))
#define bM4_TMR62_DTDBR_DTDB0                     (*((volatile unsigned int*)(0x42308980UL)))
#define bM4_TMR62_DTDBR_DTDB1                     (*((volatile unsigned int*)(0x42308984UL)))
#define bM4_TMR62_DTDBR_DTDB2                     (*((volatile unsigned int*)(0x42308988UL)))
#define bM4_TMR62_DTDBR_DTDB3                     (*((volatile unsigned int*)(0x4230898CUL)))
#define bM4_TMR62_DTDBR_DTDB4                     (*((volatile unsigned int*)(0x42308990UL)))
#define bM4_TMR62_DTDBR_DTDB5                     (*((volatile unsigned int*)(0x42308994UL)))
#define bM4_TMR62_DTDBR_DTDB6                     (*((volatile unsigned int*)(0x42308998UL)))
#define bM4_TMR62_DTDBR_DTDB7                     (*((volatile unsigned int*)(0x4230899CUL)))
#define bM4_TMR62_DTDBR_DTDB8                     (*((volatile unsigned int*)(0x423089A0UL)))
#define bM4_TMR62_DTDBR_DTDB9                     (*((volatile unsigned int*)(0x423089A4UL)))
#define bM4_TMR62_DTDBR_DTDB10                    (*((volatile unsigned int*)(0x423089A8UL)))
#define bM4_TMR62_DTDBR_DTDB11                    (*((volatile unsigned int*)(0x423089ACUL)))
#define bM4_TMR62_DTDBR_DTDB12                    (*((volatile unsigned int*)(0x423089B0UL)))
#define bM4_TMR62_DTDBR_DTDB13                    (*((volatile unsigned int*)(0x423089B4UL)))
#define bM4_TMR62_DTDBR_DTDB14                    (*((volatile unsigned int*)(0x423089B8UL)))
#define bM4_TMR62_DTDBR_DTDB15                    (*((volatile unsigned int*)(0x423089BCUL)))
#define bM4_TMR62_GCONR_START                     (*((volatile unsigned int*)(0x42308A00UL)))
#define bM4_TMR62_GCONR_MODE0                     (*((volatile unsigned int*)(0x42308A04UL)))
#define bM4_TMR62_GCONR_MODE1                     (*((volatile unsigned int*)(0x42308A08UL)))
#define bM4_TMR62_GCONR_MODE2                     (*((volatile unsigned int*)(0x42308A0CUL)))
#define bM4_TMR62_GCONR_CKDIV0                    (*((volatile unsigned int*)(0x42308A10UL)))
#define bM4_TMR62_GCONR_CKDIV1                    (*((volatile unsigned int*)(0x42308A14UL)))
#define bM4_TMR62_GCONR_CKDIV2                    (*((volatile unsigned int*)(0x42308A18UL)))
#define bM4_TMR62_GCONR_DIR                       (*((volatile unsigned int*)(0x42308A20UL)))
#define bM4_TMR62_GCONR_ZMSKREV                   (*((volatile unsigned int*)(0x42308A40UL)))
#define bM4_TMR62_GCONR_ZMSKPOS                   (*((volatile unsigned int*)(0x42308A44UL)))
#define bM4_TMR62_GCONR_ZMSKVAL0                  (*((volatile unsigned int*)(0x42308A48UL)))
#define bM4_TMR62_GCONR_ZMSKVAL1                  (*((volatile unsigned int*)(0x42308A4CUL)))
#define bM4_TMR62_ICONR_INTENA                    (*((volatile unsigned int*)(0x42308A80UL)))
#define bM4_TMR62_ICONR_INTENB                    (*((volatile unsigned int*)(0x42308A84UL)))
#define bM4_TMR62_ICONR_INTENC                    (*((volatile unsigned int*)(0x42308A88UL)))
#define bM4_TMR62_ICONR_INTEND                    (*((volatile unsigned int*)(0x42308A8CUL)))
#define bM4_TMR62_ICONR_INTENE                    (*((volatile unsigned int*)(0x42308A90UL)))
#define bM4_TMR62_ICONR_INTENF                    (*((volatile unsigned int*)(0x42308A94UL)))
#define bM4_TMR62_ICONR_INTENOVF                  (*((volatile unsigned int*)(0x42308A98UL)))
#define bM4_TMR62_ICONR_INTENUDF                  (*((volatile unsigned int*)(0x42308A9CUL)))
#define bM4_TMR62_ICONR_INTENDTE                  (*((volatile unsigned int*)(0x42308AA0UL)))
#define bM4_TMR62_ICONR_INTENSAU                  (*((volatile unsigned int*)(0x42308AC0UL)))
#define bM4_TMR62_ICONR_INTENSAD                  (*((volatile unsigned int*)(0x42308AC4UL)))
#define bM4_TMR62_ICONR_INTENSBU                  (*((volatile unsigned int*)(0x42308AC8UL)))
#define bM4_TMR62_ICONR_INTENSBD                  (*((volatile unsigned int*)(0x42308ACCUL)))
#define bM4_TMR62_PCONR_CAPMDA                    (*((volatile unsigned int*)(0x42308B00UL)))
#define bM4_TMR62_PCONR_STACA                     (*((volatile unsigned int*)(0x42308B04UL)))
#define bM4_TMR62_PCONR_STPCA                     (*((volatile unsigned int*)(0x42308B08UL)))
#define bM4_TMR62_PCONR_STASTPSA                  (*((volatile unsigned int*)(0x42308B0CUL)))
#define bM4_TMR62_PCONR_CMPCA0                    (*((volatile unsigned int*)(0x42308B10UL)))
#define bM4_TMR62_PCONR_CMPCA1                    (*((volatile unsigned int*)(0x42308B14UL)))
#define bM4_TMR62_PCONR_PERCA0                    (*((volatile unsigned int*)(0x42308B18UL)))
#define bM4_TMR62_PCONR_PERCA1                    (*((volatile unsigned int*)(0x42308B1CUL)))
#define bM4_TMR62_PCONR_OUTENA                    (*((volatile unsigned int*)(0x42308B20UL)))
#define bM4_TMR62_PCONR_EMBVALA0                  (*((volatile unsigned int*)(0x42308B2CUL)))
#define bM4_TMR62_PCONR_EMBVALA1                  (*((volatile unsigned int*)(0x42308B30UL)))
#define bM4_TMR62_PCONR_CAPMDB                    (*((volatile unsigned int*)(0x42308B40UL)))
#define bM4_TMR62_PCONR_STACB                     (*((volatile unsigned int*)(0x42308B44UL)))
#define bM4_TMR62_PCONR_STPCB                     (*((volatile unsigned int*)(0x42308B48UL)))
#define bM4_TMR62_PCONR_STASTPSB                  (*((volatile unsigned int*)(0x42308B4CUL)))
#define bM4_TMR62_PCONR_CMPCB0                    (*((volatile unsigned int*)(0x42308B50UL)))
#define bM4_TMR62_PCONR_CMPCB1                    (*((volatile unsigned int*)(0x42308B54UL)))
#define bM4_TMR62_PCONR_PERCB0                    (*((volatile unsigned int*)(0x42308B58UL)))
#define bM4_TMR62_PCONR_PERCB1                    (*((volatile unsigned int*)(0x42308B5CUL)))
#define bM4_TMR62_PCONR_OUTENB                    (*((volatile unsigned int*)(0x42308B60UL)))
#define bM4_TMR62_PCONR_EMBVALB0                  (*((volatile unsigned int*)(0x42308B6CUL)))
#define bM4_TMR62_PCONR_EMBVALB1                  (*((volatile unsigned int*)(0x42308B70UL)))
#define bM4_TMR62_BCONR_BENA                      (*((volatile unsigned int*)(0x42308B80UL)))
#define bM4_TMR62_BCONR_BSEA                      (*((volatile unsigned int*)(0x42308B84UL)))
#define bM4_TMR62_BCONR_BENB                      (*((volatile unsigned int*)(0x42308B88UL)))
#define bM4_TMR62_BCONR_BSEB                      (*((volatile unsigned int*)(0x42308B8CUL)))
#define bM4_TMR62_BCONR_BENP                      (*((volatile unsigned int*)(0x42308BA0UL)))
#define bM4_TMR62_BCONR_BSEP                      (*((volatile unsigned int*)(0x42308BA4UL)))
#define bM4_TMR62_BCONR_BENSPA                    (*((volatile unsigned int*)(0x42308BC0UL)))
#define bM4_TMR62_BCONR_BSESPA                    (*((volatile unsigned int*)(0x42308BC4UL)))
#define bM4_TMR62_BCONR_BTRSPA0                   (*((volatile unsigned int*)(0x42308BD0UL)))
#define bM4_TMR62_BCONR_BTRSPA1                   (*((volatile unsigned int*)(0x42308BD4UL)))
#define bM4_TMR62_BCONR_BENSPB                    (*((volatile unsigned int*)(0x42308BE0UL)))
#define bM4_TMR62_BCONR_BSESPB                    (*((volatile unsigned int*)(0x42308BE4UL)))
#define bM4_TMR62_BCONR_BTRSPB0                   (*((volatile unsigned int*)(0x42308BF0UL)))
#define bM4_TMR62_BCONR_BTRSPB1                   (*((volatile unsigned int*)(0x42308BF4UL)))
#define bM4_TMR62_DCONR_DTCEN                     (*((volatile unsigned int*)(0x42308C00UL)))
#define bM4_TMR62_DCONR_DTBENU                    (*((volatile unsigned int*)(0x42308C10UL)))
#define bM4_TMR62_DCONR_DTBEND                    (*((volatile unsigned int*)(0x42308C14UL)))
#define bM4_TMR62_DCONR_SEPA                      (*((volatile unsigned int*)(0x42308C20UL)))
#define bM4_TMR62_FCONR_NOFIENGA                  (*((volatile unsigned int*)(0x42308D00UL)))
#define bM4_TMR62_FCONR_NOFICKGA0                 (*((volatile unsigned int*)(0x42308D04UL)))
#define bM4_TMR62_FCONR_NOFICKGA1                 (*((volatile unsigned int*)(0x42308D08UL)))
#define bM4_TMR62_FCONR_NOFIENGB                  (*((volatile unsigned int*)(0x42308D10UL)))
#define bM4_TMR62_FCONR_NOFICKGB0                 (*((volatile unsigned int*)(0x42308D14UL)))
#define bM4_TMR62_FCONR_NOFICKGB1                 (*((volatile unsigned int*)(0x42308D18UL)))
#define bM4_TMR62_FCONR_NOFIENTA                  (*((volatile unsigned int*)(0x42308D40UL)))
#define bM4_TMR62_FCONR_NOFICKTA0                 (*((volatile unsigned int*)(0x42308D44UL)))
#define bM4_TMR62_FCONR_NOFICKTA1                 (*((volatile unsigned int*)(0x42308D48UL)))
#define bM4_TMR62_FCONR_NOFIENTB                  (*((volatile unsigned int*)(0x42308D50UL)))
#define bM4_TMR62_FCONR_NOFICKTB0                 (*((volatile unsigned int*)(0x42308D54UL)))
#define bM4_TMR62_FCONR_NOFICKTB1                 (*((volatile unsigned int*)(0x42308D58UL)))
#define bM4_TMR62_VPERR_SPPERIA                   (*((volatile unsigned int*)(0x42308DA0UL)))
#define bM4_TMR62_VPERR_SPPERIB                   (*((volatile unsigned int*)(0x42308DA4UL)))
#define bM4_TMR62_VPERR_PCNTE0                    (*((volatile unsigned int*)(0x42308DC0UL)))
#define bM4_TMR62_VPERR_PCNTE1                    (*((volatile unsigned int*)(0x42308DC4UL)))
#define bM4_TMR62_VPERR_PCNTS0                    (*((volatile unsigned int*)(0x42308DC8UL)))
#define bM4_TMR62_VPERR_PCNTS1                    (*((volatile unsigned int*)(0x42308DCCUL)))
#define bM4_TMR62_VPERR_PCNTS2                    (*((volatile unsigned int*)(0x42308DD0UL)))
#define bM4_TMR62_STFLR_CMAF                      (*((volatile unsigned int*)(0x42308E00UL)))
#define bM4_TMR62_STFLR_CMBF                      (*((volatile unsigned int*)(0x42308E04UL)))
#define bM4_TMR62_STFLR_CMCF                      (*((volatile unsigned int*)(0x42308E08UL)))
#define bM4_TMR62_STFLR_CMDF                      (*((volatile unsigned int*)(0x42308E0CUL)))
#define bM4_TMR62_STFLR_CMEF                      (*((volatile unsigned int*)(0x42308E10UL)))
#define bM4_TMR62_STFLR_CMFF                      (*((volatile unsigned int*)(0x42308E14UL)))
#define bM4_TMR62_STFLR_OVFF                      (*((volatile unsigned int*)(0x42308E18UL)))
#define bM4_TMR62_STFLR_UDFF                      (*((volatile unsigned int*)(0x42308E1CUL)))
#define bM4_TMR62_STFLR_DTEF                      (*((volatile unsigned int*)(0x42308E20UL)))
#define bM4_TMR62_STFLR_CMSAUF                    (*((volatile unsigned int*)(0x42308E24UL)))
#define bM4_TMR62_STFLR_CMSADF                    (*((volatile unsigned int*)(0x42308E28UL)))
#define bM4_TMR62_STFLR_CMSBUF                    (*((volatile unsigned int*)(0x42308E2CUL)))
#define bM4_TMR62_STFLR_CMSBDF                    (*((volatile unsigned int*)(0x42308E30UL)))
#define bM4_TMR62_STFLR_VPERNUM0                  (*((volatile unsigned int*)(0x42308E54UL)))
#define bM4_TMR62_STFLR_VPERNUM1                  (*((volatile unsigned int*)(0x42308E58UL)))
#define bM4_TMR62_STFLR_VPERNUM2                  (*((volatile unsigned int*)(0x42308E5CUL)))
#define bM4_TMR62_STFLR_DIRF                      (*((volatile unsigned int*)(0x42308E7CUL)))
#define bM4_TMR62_HSTAR_HSTA0                     (*((volatile unsigned int*)(0x42308E80UL)))
#define bM4_TMR62_HSTAR_HSTA1                     (*((volatile unsigned int*)(0x42308E84UL)))
#define bM4_TMR62_HSTAR_HSTA4                     (*((volatile unsigned int*)(0x42308E90UL)))
#define bM4_TMR62_HSTAR_HSTA5                     (*((volatile unsigned int*)(0x42308E94UL)))
#define bM4_TMR62_HSTAR_HSTA6                     (*((volatile unsigned int*)(0x42308E98UL)))
#define bM4_TMR62_HSTAR_HSTA7                     (*((volatile unsigned int*)(0x42308E9CUL)))
#define bM4_TMR62_HSTAR_HSTA8                     (*((volatile unsigned int*)(0x42308EA0UL)))
#define bM4_TMR62_HSTAR_HSTA9                     (*((volatile unsigned int*)(0x42308EA4UL)))
#define bM4_TMR62_HSTAR_HSTA10                    (*((volatile unsigned int*)(0x42308EA8UL)))
#define bM4_TMR62_HSTAR_HSTA11                    (*((volatile unsigned int*)(0x42308EACUL)))
#define bM4_TMR62_HSTAR_STARTS                    (*((volatile unsigned int*)(0x42308EFCUL)))
#define bM4_TMR62_HSTPR_HSTP0                     (*((volatile unsigned int*)(0x42308F00UL)))
#define bM4_TMR62_HSTPR_HSTP1                     (*((volatile unsigned int*)(0x42308F04UL)))
#define bM4_TMR62_HSTPR_HSTP4                     (*((volatile unsigned int*)(0x42308F10UL)))
#define bM4_TMR62_HSTPR_HSTP5                     (*((volatile unsigned int*)(0x42308F14UL)))
#define bM4_TMR62_HSTPR_HSTP6                     (*((volatile unsigned int*)(0x42308F18UL)))
#define bM4_TMR62_HSTPR_HSTP7                     (*((volatile unsigned int*)(0x42308F1CUL)))
#define bM4_TMR62_HSTPR_HSTP8                     (*((volatile unsigned int*)(0x42308F20UL)))
#define bM4_TMR62_HSTPR_HSTP9                     (*((volatile unsigned int*)(0x42308F24UL)))
#define bM4_TMR62_HSTPR_HSTP10                    (*((volatile unsigned int*)(0x42308F28UL)))
#define bM4_TMR62_HSTPR_HSTP11                    (*((volatile unsigned int*)(0x42308F2CUL)))
#define bM4_TMR62_HSTPR_STOPS                     (*((volatile unsigned int*)(0x42308F7CUL)))
#define bM4_TMR62_HCLRR_HCLE0                     (*((volatile unsigned int*)(0x42308F80UL)))
#define bM4_TMR62_HCLRR_HCLE1                     (*((volatile unsigned int*)(0x42308F84UL)))
#define bM4_TMR62_HCLRR_HCLE4                     (*((volatile unsigned int*)(0x42308F90UL)))
#define bM4_TMR62_HCLRR_HCLE5                     (*((volatile unsigned int*)(0x42308F94UL)))
#define bM4_TMR62_HCLRR_HCLE6                     (*((volatile unsigned int*)(0x42308F98UL)))
#define bM4_TMR62_HCLRR_HCLE7                     (*((volatile unsigned int*)(0x42308F9CUL)))
#define bM4_TMR62_HCLRR_HCLE8                     (*((volatile unsigned int*)(0x42308FA0UL)))
#define bM4_TMR62_HCLRR_HCLE9                     (*((volatile unsigned int*)(0x42308FA4UL)))
#define bM4_TMR62_HCLRR_HCLE10                    (*((volatile unsigned int*)(0x42308FA8UL)))
#define bM4_TMR62_HCLRR_HCLE11                    (*((volatile unsigned int*)(0x42308FACUL)))
#define bM4_TMR62_HCLRR_CLEARS                    (*((volatile unsigned int*)(0x42308FFCUL)))
#define bM4_TMR62_HCPAR_HCPA0                     (*((volatile unsigned int*)(0x42309000UL)))
#define bM4_TMR62_HCPAR_HCPA1                     (*((volatile unsigned int*)(0x42309004UL)))
#define bM4_TMR62_HCPAR_HCPA4                     (*((volatile unsigned int*)(0x42309010UL)))
#define bM4_TMR62_HCPAR_HCPA5                     (*((volatile unsigned int*)(0x42309014UL)))
#define bM4_TMR62_HCPAR_HCPA6                     (*((volatile unsigned int*)(0x42309018UL)))
#define bM4_TMR62_HCPAR_HCPA7                     (*((volatile unsigned int*)(0x4230901CUL)))
#define bM4_TMR62_HCPAR_HCPA8                     (*((volatile unsigned int*)(0x42309020UL)))
#define bM4_TMR62_HCPAR_HCPA9                     (*((volatile unsigned int*)(0x42309024UL)))
#define bM4_TMR62_HCPAR_HCPA10                    (*((volatile unsigned int*)(0x42309028UL)))
#define bM4_TMR62_HCPAR_HCPA11                    (*((volatile unsigned int*)(0x4230902CUL)))
#define bM4_TMR62_HCPBR_HCPB0                     (*((volatile unsigned int*)(0x42309080UL)))
#define bM4_TMR62_HCPBR_HCPB1                     (*((volatile unsigned int*)(0x42309084UL)))
#define bM4_TMR62_HCPBR_HCPB4                     (*((volatile unsigned int*)(0x42309090UL)))
#define bM4_TMR62_HCPBR_HCPB5                     (*((volatile unsigned int*)(0x42309094UL)))
#define bM4_TMR62_HCPBR_HCPB6                     (*((volatile unsigned int*)(0x42309098UL)))
#define bM4_TMR62_HCPBR_HCPB7                     (*((volatile unsigned int*)(0x4230909CUL)))
#define bM4_TMR62_HCPBR_HCPB8                     (*((volatile unsigned int*)(0x423090A0UL)))
#define bM4_TMR62_HCPBR_HCPB9                     (*((volatile unsigned int*)(0x423090A4UL)))
#define bM4_TMR62_HCPBR_HCPB10                    (*((volatile unsigned int*)(0x423090A8UL)))
#define bM4_TMR62_HCPBR_HCPB11                    (*((volatile unsigned int*)(0x423090ACUL)))
#define bM4_TMR62_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x42309100UL)))
#define bM4_TMR62_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x42309104UL)))
#define bM4_TMR62_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x42309108UL)))
#define bM4_TMR62_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x4230910CUL)))
#define bM4_TMR62_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x42309110UL)))
#define bM4_TMR62_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x42309114UL)))
#define bM4_TMR62_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x42309118UL)))
#define bM4_TMR62_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x4230911CUL)))
#define bM4_TMR62_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x42309120UL)))
#define bM4_TMR62_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x42309124UL)))
#define bM4_TMR62_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x42309128UL)))
#define bM4_TMR62_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x4230912CUL)))
#define bM4_TMR62_HCUPR_HCUP16                    (*((volatile unsigned int*)(0x42309140UL)))
#define bM4_TMR62_HCUPR_HCUP17                    (*((volatile unsigned int*)(0x42309144UL)))
#define bM4_TMR62_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x42309180UL)))
#define bM4_TMR62_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x42309184UL)))
#define bM4_TMR62_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x42309188UL)))
#define bM4_TMR62_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x4230918CUL)))
#define bM4_TMR62_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x42309190UL)))
#define bM4_TMR62_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x42309194UL)))
#define bM4_TMR62_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x42309198UL)))
#define bM4_TMR62_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x4230919CUL)))
#define bM4_TMR62_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x423091A0UL)))
